[
  {
    "id": "twk-01",
    "category": "TWK",
    "text": "Seorang atlet bulutangkis Indonesia memutuskan untuk menolak tawaran menjadi warga negara asing meskipun dijanjikan fasilitas latihan yang jauh lebih mewah dan gaji yang fantastis. Ia memilih tetap membela Merah Putih meski fasilitas di dalam negeri masih terbatas. Sikap atlet tersebut merupakan cerminan nyata dari...",
    "explanation": "Tindakan atlet tersebut menunjukkan sikap 'Rela Berkorban' demi kebanggaan bangsa di atas kepentingan pribadi/materi, yang merupakan inti dari PATRIOTISME. Nasionalisme adalah perasaannya, Patriotisme adalah aksi pengorbanannya.",
    "options": [
      { "key": "A", "text": "Nasionalisme dalam arti sempit", "score": 0 },
      { "key": "B", "text": "Chauvinisme", "score": 0 },
      { "key": "C", "text": "Patriotisme", "score": 5 },
      { "key": "D", "text": "Etnosentrisme", "score": 0 },
      { "key": "E", "text": "Provincialisme", "score": 0 }
    ]
  },
  {
    "id": "twk-02",
    "category": "TWK",
    "text": "Organisasi Budi Utomo yang didirikan pada tahun 1908 sering disebut sebagai tonggak Kebangkitan Nasional. Namun, pada awal berdirinya, organisasi ini dikritik karena ruang geraknya yang terbatas. Apa keterbatasan utama Budi Utomo di fase awal yang membedakannya dengan organisasi pergerakan selanjutnya seperti Sarekat Islam?",
    "explanation": "Budi Utomo awalnya hanya bergerak di bidang sosial-budaya (pendidikan) dan keanggotaannya terbatas pada suku Jawa dan Madura serta kalangan priyayi, belum menyentuh ranah politik nasional secara luas seperti Sarekat Islam.",
    "options": [
      { "key": "A", "text": "Bersifat radikal dan menolak kerjasama dengan Belanda", "score": 0 },
      { "key": "B", "text": "Hanya fokus pada bidang ekonomi perdagangan", "score": 0 },
      { "key": "C", "text": "Keanggotaannya terbatas pada Jawa-Madura dan bersifat kooperatif", "score": 5 },
      { "key": "D", "text": "Sudah menuntut kemerdekaan Indonesia secara mutlak", "score": 0 },
      { "key": "E", "text": "Dipimpin oleh tokoh-tokoh komunis", "score": 0 }
    ]
  },
  {
    "id": "twk-03",
    "category": "TWK",
    "text": "Dalam sidang BPUPKI pertama, para tokoh pendiri bangsa berdebat hebat mengenai dasar negara. Meskipun memiliki latar belakang ideologi yang berbeda (Nasionalis Sekuler dan Nasionalis Islam), mereka akhirnya sepakat pada Piagam Jakarta. Sikap kenegarawanan apa yang paling menonjol dari peristiwa ini?",
    "explanation": "Kunci dari kesepakatan tersebut adalah kemampuan menekan ego golongan demi kepentingan yang lebih besar (Persatuan Indonesia), yang tercermin dalam kompromi Piagam Jakarta sebelum akhirnya disahkan menjadi Pancasila.",
    "options": [
      { "key": "A", "text": "Semangat mendominasi golongan minoritas", "score": 0 },
      { "key": "B", "text": "Sikap mengalah tanpa memperjuangkan prinsip", "score": 0 },
      { "key": "C", "text": "Mengutamakan persatuan di atas kepentingan golongan", "score": 5 },
      { "key": "D", "text": "Kepatuhan mutlak kepada pemerintah Jepang", "score": 0 },
      { "key": "E", "text": "Keinginan untuk mendirikan negara agama", "score": 0 }
    ]
  },
  {
    "id": "twk-04",
    "category": "TWK",
    "text": "Peristiwa Rengasdengklok pada tanggal 16 Agustus 1945 terjadi karena adanya perbedaan pandangan antara Golongan Muda dan Golongan Tua. Inti perbedaan pandangan tersebut bukan mengenai 'apakah' kita harus merdeka, melainkan mengenai...",
    "explanation": "Perbedaan utama adalah soal 'Waktu dan Cara'. Golongan Tua ingin melalui prosedur PPKI (agar tidak bentrok dengan Jepang), sedangkan Golongan Muda ingin proklamasi dilakukan secepatnya tanpa campur tangan PPKI yang dianggap buatan Jepang.",
    "options": [
      { "key": "A", "text": "Siapa yang akan menandatangani teks proklamasi", "score": 0 },
      { "key": "B", "text": "Bentuk negara (Republik atau Kerajaan)", "score": 0 },
      { "key": "C", "text": "Waktu dan cara pelaksanaan proklamasi", "score": 5 },
      { "key": "D", "text": "Lokasi pembacaan teks proklamasi", "score": 0 },
      { "key": "E", "text": "Isi dari teks proklamasi", "score": 0 }
    ]
  },
  {
    "id": "twk-05",
    "category": "TWK",
    "text": "Pada masa mempertahankan kemerdekaan, Indonesia menempuh jalur diplomasi dan perjuangan fisik. Perjanjian Renville dianggap sebagai salah satu titik terendah diplomasi Indonesia karena...",
    "explanation": "Renville sangat merugikan karena wilayah RI diakui semakin sempit (Hanya Yogyakarta dan sebagian Jawa), serta TNI harus ditarik mundur dari kantong-kantong gerilya (Jawa Barat) ke wilayah RI (Long March Siliwangi).",
    "options": [
      { "key": "A", "text": "Belanda mengakui kedaulatan RI secara penuh", "score": 0 },
      { "key": "B", "text": "Indonesia harus membayar hutang perang Belanda", "score": 0 },
      { "key": "C", "text": "Wilayah RI menjadi semakin sempit dan TNI harus hijrah", "score": 5 },
      { "key": "D", "text": "Soekarno dan Hatta diasingkan ke Bangka", "score": 0 },
      { "key": "E", "text": "Dibentuknya Republik Indonesia Serikat (RIS)", "score": 0 }
    ]
  },
  {
    "id": "twk-06",
    "category": "TWK",
    "text": "Nasionalisme di era digital menghadapi tantangan berbeda. Maraknya berita bohong (hoaks) yang mengadu domba antarsuku di media sosial merupakan ancaman serius bagi integrasi nasional. Sikap nasionalisme yang tepat bagi seorang ASN dalam menghadapi fenomena ini adalah...",
    "explanation": "Nasionalisme era digital diwujudkan dengan literasi digital: menyaring informasi sebelum menyebarkan (Saring sebelum Sharing) untuk menjaga persatuan.",
    "options": [
      { "key": "A", "text": "Memblokir semua akun media sosial agar tidak terpapar", "score": 0 },
      { "key": "B", "text": "Hanya membaca berita yang mendukung opini pribadi", "score": 0 },
      { "key": "C", "text": "Melakukan filter informasi dan cek fakta sebelum menyebarkan berita", "score": 5 },
      { "key": "D", "text": "Membalas komentar negatif dengan komentar yang lebih pedas", "score": 0 },
      { "key": "E", "text": "Melaporkan semua kritik pemerintah sebagai ujaran kebencian", "score": 0 }
    ]
  },
  {
    "id": "twk-07",
    "category": "TWK",
    "text": "Konsep 'Bhinneka Tunggal Ika' diambil dari Kitab Sutasoma karangan Mpu Tantular. Dalam konteks sejarah Kerajaan Majapahit, frasa ini awalnya digunakan untuk mendamaikan keberagaman dalam hal...",
    "explanation": "Secara historis, Bhinneka Tunggal Ika dalam Sutasoma merujuk pada toleransi antara pemeluk agama Hindu (Siwa) dan Buddha di masa Majapahit, yang kemudian diadopsi menjadi semboyan persatuan nasional.",
    "options": [
      { "key": "A", "text": "Suku dan Ras", "score": 0 },
      { "key": "B", "text": "Bahasa daerah", "score": 0 },
      { "key": "C", "text": "Agama (Hindu dan Buddha)", "score": 5 },
      { "key": "D", "text": "Strata sosial (Kasta)", "score": 0 },
      { "key": "E", "text": "Wilayah kepulauan", "score": 0 }
    ]
  },
  {
    "id": "twk-08",
    "category": "TWK",
    "text": "Chauvinisme adalah bentuk cinta tanah air yang berlebihan hingga merendahkan bangsa lain. Contoh perilaku chauvinisme yang pernah terjadi dalam sejarah dunia dan menjadi pelajaran agar tidak ditiru oleh bangsa Indonesia adalah...",
    "explanation": "Contoh paling klasik dan ekstrim dari Chauvinisme adalah Nazi Jerman di bawah Hitler yang menganggap ras Arya paling unggul dan memusnahkan ras lain. Ini bertentangan dengan Sila ke-2 Pancasila.",
    "options": [
      { "key": "A", "text": "Perjuangan Mahatma Gandhi di India", "score": 0 },
      { "key": "B", "text": "Gerakan Apartheid di Afrika Selatan", "score": 0 },
      { "key": "C", "text": "Ideologi Nazi Jerman yang mengagungkan Ras Arya", "score": 5 },
      { "key": "D", "text": "Revolusi Industri di Inggris", "score": 0 },
      { "key": "E", "text": "Perang Dingin antara AS dan Uni Soviet", "score": 0 }
    ]
  },
  {
    "id": "twk-09",
    "category": "TWK",
    "text": "Deklarasi Djuanda pada 13 Desember 1957 merupakan tonggak penting bagi kedaulatan wilayah Indonesia. Inti utama dari deklarasi ini yang mengubah konsep wilayah laut Indonesia adalah...",
    "explanation": "Sebelum Deklarasi Djuanda, laut di antara pulau-pulau dianggap perairan internasional (Warisan Belanda). Djuanda menyatakan bahwa laut antar pulau adalah wilayah kedaulatan mutlak NKRI (Negara Kepulauan/Archipelagic State), menyatukan tanah dan air.",
    "options": [
      { "key": "A", "text": "Laut hanya dihitung 3 mil dari garis pantai", "score": 0 },
      { "key": "B", "text": "Laut di antara pulau-pulau adalah wilayah bebas internasional", "score": 0 },
      { "key": "C", "text": "Semua laut di Asia Tenggara milik Indonesia", "score": 0 },
      { "key": "D", "text": "Laut antar pulau merupakan wilayah kedaulatan mutlak yang menyatukan NKRI", "score": 5 },
      { "key": "E", "text": "Indonesia melarang kapal asing melintas sama sekali", "score": 0 }
    ]
  },
  {
    "id": "twk-10",
    "category": "TWK",
    "text": "Salah satu fungsi wawasan nusantara adalah sebagai pedoman, motivasi, dorongan, serta rambu-rambu dalam menentukan segala kebijaksanaan, keputusan, tindakan, dan perbuatan bagi penyelenggara negara. Hal ini disebut sebagai fungsi wawasan nusantara dalam cakupan...",
    "explanation": "Jika berkaitan dengan 'penyelenggara negara', 'kebijakan', dan 'keputusan politik', maka itu adalah Wawasan Nusantara sebagai Wawasan Pembangunan/Nasional dalam konteks Politik/Ketatanegaraan.",
    "options": [
      { "key": "A", "text": "Konsep Ketahanan Nasional", "score": 0 },
      { "key": "B", "text": "Wawasan Kewilayahan", "score": 0 },
      { "key": "C", "text": "Wawasan Pembangunan Nasional", "score": 5 },
      { "key": "D", "text": "Konsep Pertahanan Keamanan", "score": 0 },
      { "key": "E", "text": "Wawasan Sosial Budaya", "score": 0 }
    ]
  }
]