[
    {
      "id": "P4-TWK-01",
      "category": "TWK",
      "text": "Dalam sidang BPUPKI, perdebatan mengenai dasar negara sangat dinamis. Kubu nasionalis sekuler menginginkan negara kebangsaan, sementara kubu nasionalis Islam menginginkan negara berdasarkan syariat. Piagam Jakarta (Jakarta Charter) lahir sebagai 'gentlemen's agreement'. Nilai fundamental yang terkandung dalam kompromi politik tersebut adalah...",
      "explanation": "HOTS Analisis Sejarah: Piagam Jakarta adalah bukti kenegarawanan para pendiri bangsa yang rela menurunkan ego golongan demi persatuan bangsa (Sila ke-3) dan musyawarah mufakat (Sila ke-4). Intinya adalah semangat persatuan di atas golongan.",
      "options": [
        { "key": "A", "text": "Kemenangan kelompok mayoritas atas minoritas.", "score": 0 },
        { "key": "B", "text": "Kegagalan diplomasi kaum nasionalis sekuler.", "score": 0 },
        { "key": "C", "text": "Semangat persatuan dan kerelaan berkorban demi keutuhan bangsa.", "score": 5 },
        { "key": "D", "text": "Dominasi hukum agama dalam tata negara.", "score": 0 },
        { "key": "E", "text": "Pemisahan tegas antara urusan agama dan negara.", "score": 0 }
      ]
    },
    {
      "id": "P4-TWK-02",
      "category": "TWK",
      "text": "Seorang ASN menerima parsel lebaran dari rekanan kontraktor yang sedang mengikuti tender di kantornya. ASN tersebut melaporkan penerimaan tersebut kepada Unit Pengendalian Gratifikasi (UPG) dalam waktu kurang dari 30 hari kerja. Tindakan ASN tersebut mencerminkan nilai integritas...",
      "explanation": "Integritas: Melaporkan gratifikasi adalah wujud Jujur dan Berani. Hal ini sesuai dengan UU No. 20 Tahun 2001, di mana gratifikasi yang dilaporkan sebelum 30 hari kerja gugur ancaman pidananya.",
      "options": [
        { "key": "A", "text": "Kerja keras.", "score": 0 },
        { "key": "B", "text": "Sederhana.", "score": 0 },
        { "key": "C", "text": "Jujur dan Bertanggung Jawab.", "score": 5 },
        { "key": "D", "text": "Peduli.", "score": 0 },
        { "key": "E", "text": "Adil.", "score": 0 }
      ]
    },
    {
      "id": "P4-TWK-03",
      "category": "TWK",
      "text": "Ancaman nirmiliter di era globalisasi dapat berupa serangan siber yang melumpuhkan data pusat nasional. Partisipasi warga negara yang memiliki keahlian IT untuk membantu negara mengamankan jaringan tersebut dikategorikan sebagai...",
      "explanation": "Bela Negara: Berdasarkan UU No. 23 Tahun 2019 tentang Pengelolaan Sumber Daya Nasional untuk Pertahanan Negara, pengabdian sesuai profesi adalah salah satu bentuk bela negara non-fisik.",
      "options": [
        { "key": "A", "text": "Wajib militer bagi tenaga ahli.", "score": 0 },
        { "key": "B", "text": "Pengabdian sesuai profesi.", "score": 5 },
        { "key": "C", "text": "Pendidikan Kewarganegaraan.", "score": 0 },
        { "key": "D", "text": "Pelatihan Dasar Kemiliteran.", "score": 0 },
        { "key": "E", "text": "Pertahanan rakyat semesta.", "score": 0 }
      ]
    },
    {
      "id": "P4-TWK-04",
      "category": "TWK",
      "text": "Nasionalisme Indonesia bukanlah nasionalisme yang menyendiri (isolasionisme), melainkan nasionalisme yang bergaul dengan bangsa lain. Hal ini sesuai dengan prinsip yang tertuang dalam Pembukaan UUD 1945 alinea ke-4, yaitu...",
      "explanation": "Alinea 4 memuat tujuan negara, salah satunya 'ikut melaksanakan ketertiban dunia'. Ini menunjukkan nasionalisme kita bersifat humanis dan internasionalis (bebas aktif).",
      "options": [
        { "key": "A", "text": "Melindungi segenap bangsa Indonesia.", "score": 0 },
        { "key": "B", "text": "Memajukan kesejahteraan umum.", "score": 0 },
        { "key": "C", "text": "Mencerdaskan kehidupan bangsa.", "score": 0 },
        { "key": "D", "text": "Ikut melaksanakan ketertiban dunia.", "score": 5 },
        { "key": "E", "text": "Kemerdekaan adalah hak segala bangsa.", "score": 0 }
      ]
    },
    {
      "id": "P4-TWK-05",
      "category": "TWK",
      "text": "Sila 'Kerakyatan yang Dipimpin oleh Hikmat Kebijaksanaan dalam Permusyawaratan/Perwakilan' mengandung makna bahwa keputusan terbaik lahir dari...",
      "explanation": "Esensi Sila ke-4 adalah musyawarah mufakat. Demokrasi Pancasila tidak mengutamakan suara terbanyak (voting) sebagai opsi pertama, melainkan sintesis pendapat melalui hikmat kebijaksanaan (rasionalitas moral).",
      "options": [
        { "key": "A", "text": "Suara terbanyak (voting) mutlak.", "score": 0 },
        { "key": "B", "text": "Dominasi kaum intelektual dalam pemerintahan.", "score": 0 },
        { "key": "C", "text": "Keputusan pimpinan tertinggi negara.", "score": 0 },
        { "key": "D", "text": "Akal sehat dan hati nurani yang luhur melalui proses musyawarah.", "score": 5 },
        { "key": "E", "text": "Tekanan dari kelompok mayoritas.", "score": 0 }
      ]
    },
    {
      "id": "P4-TWK-06",
      "category": "TWK",
      "text": "Mewujudkan keadilan sosial bagi seluruh rakyat Indonesia (Sila ke-5) dalam konteks pembangunan ekonomi dilakukan dengan cara...",
      "explanation": "Keadilan sosial (Sila 5) menolak etatisme (negara menguasai semua) dan liberalisme (pasar bebas tanpa kendali). Ekonomi Pancasila mencegah monopoli yang merugikan rakyat.",
      "options": [
        { "key": "A", "text": "Menyerahkan seluruh mekanisme pasar kepada swasta (Liberal).", "score": 0 },
        { "key": "B", "text": "Negara menguasai seluruh aspek produksi tanpa kecuali (Etatisme).", "score": 0 },
        { "key": "C", "text": "Mencegah terjadinya monopoli dan oligopoli yang merugikan masyarakat.", "score": 5 },
        { "key": "D", "text": "Memberikan bantuan tunai terus menerus tanpa pemberdayaan.", "score": 0 },
        { "key": "E", "text": "Meningkatkan pajak setinggi-tingginya bagi semua kalangan.", "score": 0 }
      ]
    },
    {
      "id": "P4-TWK-07",
      "category": "TWK",
      "text": "Tantangan Pancasila di era digital adalah munculnya 'Echo Chamber' di media sosial, di mana seseorang hanya mendengar informasi yang sesuai dengan keyakinannya sendiri. Hal ini dapat menggerus nilai...",
      "explanation": "Echo Chamber membuat orang intoleran dan merasa paling benar, yang secara langsung mengancam Persatuan Indonesia (Sila ke-3) dan memicu konflik horizontal.",
      "options": [
        { "key": "A", "text": "Ketuhanan yang Maha Esa.", "score": 0 },
        { "key": "B", "text": "Kemanusiaan yang adil dan beradab.", "score": 0 },
        { "key": "C", "text": "Persatuan Indonesia.", "score": 5 },
        { "key": "D", "text": "Keadilan sosial.", "score": 0 },
        { "key": "E", "text": "Kedaulatan rakyat.", "score": 0 }
      ]
    },
    {
      "id": "P4-TWK-08",
      "category": "TWK",
      "text": "Peristiwa Agresi Militer Belanda II yang menyebabkan ditangkapnya Soekarno-Hatta di Yogyakarta direspon dengan pembentukan Pemerintahan Darurat Republik Indonesia (PDRI) di Bukittinggi. Hal ini menunjukkan bahwa...",
      "explanation": "Eksistensi negara tidak bergantung pada fisik pemimpin atau ibukota, melainkan pada keberlangsungan pemerintahan (de facto). PDRI yang dipimpin Syafruddin Prawiranegara menyelamatkan kedaulatan RI.",
      "options": [
        { "key": "A", "text": "TNI telah kalah total dalam peperangan.", "score": 0 },
        { "key": "B", "text": "Eksistensi negara tetap berdiri selama masih ada pemerintahan yang berdaulat.", "score": 5 },
        { "key": "C", "text": "Belanda berhasil menguasai seluruh wilayah Indonesia secara hukum.", "score": 0 },
        { "key": "D", "text": "Perpecahan antara pemimpin sipil dan militer.", "score": 0 },
        { "key": "E", "text": "Kegagalan diplomasi internasional Indonesia.", "score": 0 }
      ]
    },
    {
      "id": "P4-TWK-09",
      "category": "TWK",
      "text": "Kalimat Efektif: Manakah kalimat di bawah ini yang memenuhi syarat keparalelan (kesejajaran) bentuk?",
      "explanation": "Keparalelan berarti penggunaan imbuhan yang setara. Opsi D menggunakan 'penyediaan' (pe-an), 'pembangunan' (pe-an), dan 'perbaikan' (pe-an). Opsi lain tidak konsisten (campuran me- dan pe-an).",
      "options": [
        { "key": "A", "text": "Langkah yang dilakukan pemerintah adalah menaikkan harga BBM, perbaikan jalan, dan membangun jembatan.", "score": 0 },
        { "key": "B", "text": "Kakak menolong anak itu dengan memapahnya ke pinggir jalan dan diberikan minum.", "score": 0 },
        { "key": "C", "text": "Harga minyak dibekukan atau kenaikan secara luwes.", "score": 0 },
        { "key": "D", "text": "Program kerja tahun ini meliputi penyediaan sarana, pembangunan gedung, dan perbaikan fasilitas.", "score": 5 },
        { "key": "E", "text": "Ia dikenai denda karena melempar batu dan memecahkan kaca.", "score": 0 }
      ]
    },
    {
      "id": "P4-TWK-10",
      "category": "TWK",
      "text": "Sikap chauvinisme (nasionalisme sempit yang mengagungkan bangsa sendiri dan merendahkan bangsa lain) bertentangan dengan Pancasila, khususnya sila...",
      "explanation": "Chauvinisme melanggar nilai Kemanusiaan yang Adil dan Beradab (Sila ke-2) karena tidak menghormati harkat dan martabat manusia dari bangsa lain, serta melanggar Persatuan (Sila 3) dalam konteks pergaulan internasional.",
      "options": [
        { "key": "A", "text": "Pertama", "score": 0 },
        { "key": "B", "text": "Kedua", "score": 5 },
        { "key": "C", "text": "Ketiga", "score": 0 },
        { "key": "D", "text": "Keempat", "score": 0 },
        { "key": "E", "text": "Kelima", "score": 0 }
      ]
    },
    {
        "id": "P4-TWK-11",
        "category": "TWK",
        "text": "Sistem presidensial di Indonesia pasca amandemen UUD 1945 memiliki ciri khas 'Checks and Balances'. Salah satu wujud nyata dari mekanisme ini dalam hubungan antara Presiden dan DPR adalah...",
        "explanation": "Dalam UUD 1945 Pasal 13, Presiden dalam mengangkat duta harus memperhatikan pertimbangan DPR. Ini adalah bentuk saling mengawasi agar Presiden tidak semena-mena dalam politik luar negeri.",
        "options": [
          { "key": "A", "text": "Presiden dapat membubarkan DPR jika menghambat program pemerintah.", "score": 0 },
          { "key": "B", "text": "DPR dapat menjatuhkan Presiden kapan saja melalui mosi tidak percaya.", "score": 0 },
          { "key": "C", "text": "Presiden harus memperhatikan pertimbangan DPR dalam mengangkat duta.", "score": 5 },
          { "key": "D", "text": "Presiden bertanggung jawab langsung kepada MPR.", "score": 0 },
          { "key": "E", "text": "DPR memegang kekuasaan eksekutif bersama Presiden.", "score": 0 }
        ]
      },
      {
        "id": "P4-TWK-12",
        "category": "TWK",
        "text": "Dalam hierarki peraturan perundang-undangan di Indonesia (UU No. 12 Tahun 2011 sebagaimana diubah UU No. 13 Tahun 2022), posisi Peraturan Presiden (Perpres) berada di bawah...",
        "explanation": "Urutan hierarki: UUD 1945 -> Tap MPR -> UU/Perppu -> Peraturan Pemerintah (PP) -> Perpres -> Perda. Jadi, Perpres berada tepat di bawah PP.",
        "options": [
          { "key": "A", "text": "Undang-Undang / Perppu", "score": 0 },
          { "key": "B", "text": "Peraturan Pemerintah (PP)", "score": 5 },
          { "key": "C", "text": "Ketetapan MPR", "score": 0 },
          { "key": "D", "text": "Peraturan Daerah Provinsi", "score": 0 },
          { "key": "E", "text": "Peraturan Menteri", "score": 0 }
        ]
      },
      {
        "id": "P4-TWK-13",
        "category": "TWK",
        "text": "Hak prerogatif Presiden sebagai Kepala Negara untuk memulihkan kembali hak narapidana dengan menghapuskan seluruh akibat hukum dari vonis yang telah dijatuhkan disebut...",
        "explanation": "Rehabilitasi: Memulihkan nama baik. Amnesti: Pengampunan massal. Grasi: Pengurangan hukuman. Abolisi: Penghentian proses hukum. Namun, 'menghapuskan seluruh akibat hukum' lebih tepat mengarah pada AMNESTI (biasanya untuk tahanan politik) atau REHABILITASI (pemulihan nama baik jika salah tangkap). Jika konteksnya pengampunan total tindak pidana: AMNESTI.",
        "options": [
          { "key": "A", "text": "Grasi", "score": 0 },
          { "key": "B", "text": "Amnesti", "score": 5 },
          { "key": "C", "text": "Abolisi", "score": 0 },
          { "key": "D", "text": "Rehabilitasi", "score": 0 },
          { "key": "E", "text": "Remisi", "score": 0 }
        ]
      },
      {
        "id": "P4-TWK-14",
        "category": "TWK",
        "text": "Pasal 33 Ayat (3) UUD 1945 menyatakan 'Bumi dan air dan kekayaan alam yang terkandung di dalamnya dikuasai oleh negara...'. Makna yuridis 'dikuasai oleh negara' dalam putusan Mahkamah Konstitusi adalah...",
        "explanation": "Makna 'dikuasai negara' bukan berarti negara menjadi pemilik mutlak (eigendom), melainkan negara memiliki wewenang untuk mengatur (regelendaad), mengurus (bestuursdaad), mengelola, dan mengawasi (toezichthoudensdaad) demi kemakmuran rakyat.",
        "options": [
          { "key": "A", "text": "Negara menjadi pemilik tunggal seluruh tanah di Indonesia.", "score": 0 },
          { "key": "B", "text": "Pemerintah berhak menjual aset alam kepada pihak asing secara bebas.", "score": 0 },
          { "key": "C", "text": "Negara memiliki wewenang mengatur, mengurus, dan mengawasi pemanfaatan sumber daya alam.", "score": 5 },
          { "key": "D", "text": "Rakyat dilarang memiliki hak atas tanah pribadi.", "score": 0 },
          { "key": "E", "text": "Swasta dilarang sama sekali mengelola sumber daya alam.", "score": 0 }
        ]
      },
      {
        "id": "P4-TWK-15",
        "category": "TWK",
        "text": "Wawasan Nusantara sebagai geopolitik Indonesia memandang wilayah laut bukan sebagai pemisah, melainkan sebagai pemersatu. Konsep ini dideklarasikan pertama kali melalui...",
        "explanation": "Deklarasi Djuanda (13 Desember 1957) adalah tonggak sejarah yang mengubah konsep laut Indonesia dari 'Res Nullius' (laut bebas 3 mil) menjadi Negara Kepulauan (Archipelagic State) yang utuh.",
        "options": [
          { "key": "A", "text": "Sumpah Pemuda 1928", "score": 0 },
          { "key": "B", "text": "Deklarasi Djuanda 1957", "score": 5 },
          { "key": "C", "text": "Proklamasi Kemerdekaan 1945", "score": 0 },
          { "key": "D", "text": "Konferensi Meja Bundar 1949", "score": 0 },
          { "key": "E", "text": "Perjanjian Linggarjati 1947", "score": 0 }
        ]
      },
      {
        "id": "P4-TWK-16",
        "category": "TWK",
        "text": "Penggunaan tanda baca koma (,) yang TEPAT terdapat pada kalimat...",
        "explanation": "A Salah (sebelum 'dan' dalam perincian > 2 harus ada koma). B Salah (setelah 'karena' tidak perlu koma karena bukan anak kalimat di awal). C Benar ('Oleh karena itu' adalah konjungsi antarkalimat, wajib pakai koma). D Salah (memisahkan subjek dan predikat). E Salah (sebelum 'bahwa' tidak perlu koma).",
        "options": [
          { "key": "A", "text": "Ibu membeli sayur, ikan dan buah di pasar.", "score": 0 },
          { "key": "B", "text": "Dia tidak masuk sekolah, karena sakit parah.", "score": 0 },
          { "key": "C", "text": "Oleh karena itu, kita harus waspada terhadap berita hoaks.", "score": 5 },
          { "key": "D", "text": "Mahasiswa yang memiliki prestasi akademik tinggi, mendapat beasiswa.", "score": 0 },
          { "key": "E", "text": "Presiden menegaskan, bahwa pembangunan infrastruktur terus berlanjut.", "score": 0 }
        ]
      },
      {
        "id": "P4-TWK-17",
        "category": "TWK",
        "text": "Manakah penulisan gelar akademik yang BENAR menurut PUEBI?",
        "explanation": "Format gelar: Nama, (koma) Gelar1 (titik). Gelar2 (titik). Contoh: Prof. Dr. (Doktor) H. (Haji) Ir. (Insinyur) Budi, S.H. (Sarjana Hukum), M.H. (Magister Hukum).",
        "options": [
          { "key": "A", "text": "Dr. Ir. Budi Santoso, S.H, M.Si.", "score": 0 },
          { "key": "B", "text": "Prof. Dr. Budi Santoso, S.Pd., M.Pd.", "score": 5 },
          { "key": "C", "text": "Budi Santoso, S.Sos. M.AB", "score": 0 },
          { "key": "D", "text": "Drg. Budi Santoso. Sp.Ort.", "score": 0 },
          { "key": "E", "text": "Ir Budi Santoso, MM.", "score": 0 }
        ]
      },
      {
        "id": "P4-TWK-18",
        "category": "TWK",
        "text": "Dalam konteks Bhinneka Tunggal Ika, paham 'Etnosentrisme' dianggap berbahaya karena...",
        "explanation": "Etnosentrisme adalah sikap menganggap budaya sendiri lebih unggul daripada budaya lain, yang memicu konflik horizontal dan merusak integrasi nasional.",
        "options": [
          { "key": "A", "text": "Menerima budaya asing tanpa filter.", "score": 0 },
          { "key": "B", "text": "Menganggap budaya sendiri paling unggul dan merendahkan budaya lain.", "score": 5 },
          { "key": "C", "text": "Tidak peduli dengan urusan politik negara.", "score": 0 },
          { "key": "D", "text": "Terlalu mencintai produk dalam negeri.", "score": 0 },
          { "key": "E", "text": "Menolak kemajuan teknologi informasi.", "score": 0 }
        ]
      },
      {
        "id": "P4-TWK-19",
        "category": "TWK",
        "text": "Inti paragraf: 'Pemerintah terus menggenjot pembangunan infrastruktur digital di daerah 3T (Tertinggal, Terdepan, Terluar). Hal ini dilakukan untuk mengurangi kesenjangan akses informasi dan meningkatkan ekonomi digital masyarakat pedalaman. Namun, tantangan geografis dan minimnya literasi digital masih menjadi hambatan utama.'\nIde pokok paragraf tersebut adalah...",
        "explanation": "Ide pokok terletak di kalimat utama (awal): Upaya pemerintah membangun infrastruktur digital di daerah 3T.",
        "options": [
          { "key": "A", "text": "Hambatan geografis di daerah pedalaman.", "score": 0 },
          { "key": "B", "text": "Pentingnya literasi digital bagi masyarakat.", "score": 0 },
          { "key": "C", "text": "Pembangunan infrastruktur digital di daerah 3T oleh pemerintah.", "score": 5 },
          { "key": "D", "text": "Kesenjangan akses informasi di Indonesia.", "score": 0 },
          { "key": "E", "text": "Pertumbuhan ekonomi digital nasional.", "score": 0 }
        ]
      },
      {
        "id": "P4-TWK-20",
        "category": "TWK",
        "text": "Amandemen UUD 1945 yang membatasi masa jabatan Presiden dan Wakil Presiden maksimal dua periode (Pasal 7) merupakan respon korektif terhadap penyimpangan masa lalu, yaitu...",
        "explanation": "Pada masa Orde Lama dan Orde Baru, tidak adanya batasan tegas mengenai 'dapat dipilih kembali' menyebabkan kekuasaan presiden menjadi absolut dan seumur hidup (Executive Heavy).",
        "options": [
          { "key": "A", "text": "Lemahnya kekuasaan legislatif.", "score": 0 },
          { "key": "B", "text": "Tafsir 'dapat dipilih kembali' yang memungkinkan kekuasaan tanpa batas.", "score": 5 },
          { "key": "C", "text": "Seringnya pergantian kabinet.", "score": 0 },
          { "key": "D", "text": "Intervensi asing dalam pemilu.", "score": 0 },
          { "key": "E", "text": "Dominasi partai politik tertentu.", "score": 0 }
        ]
      },
      {
        "id": "P4-TWK-21",
        "category": "TWK",
        "text": "Pemindahan ibu kota RI dari Jakarta ke Yogyakarta pada 4 Januari 1946 bukan tanpa alasan. Faktor strategis utama yang mendasari keputusan tersebut adalah...",
        "explanation": "Situasi Jakarta sudah tidak kondusif (darurat) akibat kedatangan tentara NICA yang membonceng Sekutu, serta adanya percobaan pembunuhan terhadap pimpinan negara. Yogyakarta dipilih karena memiliki benteng alam dan dukungan penuh dari Sultan Hamengkubuwono IX.",
        "options": [
          { "key": "A", "text": "Yogyakarta memiliki fasilitas pemerintahan yang lebih lengkap dari Jakarta.", "score": 0 },
          { "key": "B", "text": "Desakan dari golongan oposisi untuk mengganti pusat pemerintahan.", "score": 0 },
          { "key": "C", "text": "Situasi keamanan Jakarta yang genting akibat teror NICA dan pasukan Sekutu.", "score": 5 },
          { "key": "D", "text": "Keinginan Sultan Hamengkubuwono IX untuk menjadi pemimpin negara.", "score": 0 },
          { "key": "E", "text": "Letak geografis Yogyakarta yang berada tepat di tengah pulau Jawa.", "score": 0 }
        ]
      },
      {
        "id": "P4-TWK-22",
        "category": "TWK",
        "text": "Pemberontakan DI/TII di Jawa Barat yang dipimpin oleh S.M. Kartosuwiryo memiliki kaitan erat dengan hasil Perjanjian Renville. Kekecewaan utama yang memicu proklamasi NII adalah...",
        "explanation": "Perjanjian Renville mengharuskan Divisi Siliwangi 'hijrah' (pindah) dari Jawa Barat ke Jawa Tengah karena Jabar diakui sebagai wilayah Belanda. Kartosuwiryo menolak hijrah dan mengisi kekosongan kekuasaan tersebut dengan mendirikan NII.",
        "options": [
          { "key": "A", "text": "Pemerintah RI menolak menjadikan Islam sebagai dasar negara.", "score": 0 },
          { "key": "B", "text": "Kewajiban Divisi Siliwangi untuk hijrah dan meninggalkan wilayah Jawa Barat.", "score": 5 },
          { "key": "C", "text": "Kartosuwiryo tidak mendapatkan jabatan di kabinet Hatta.", "score": 0 },
          { "key": "D", "text": "Dominasi golongan komunis dalam pemerintahan pusat.", "score": 0 },
          { "key": "E", "text": "Kegagalan pemerintah mengatasi agresi militer Belanda.", "score": 0 }
        ]
      },
      {
        "id": "P4-TWK-23",
        "category": "TWK",
        "text": "Organisasi Budi Utomo (1908) sering disebut sebagai tonggak Kebangkitan Nasional, namun Sarekat Islam (1912) dianggap lebih berhasil memobilisasi massa rakyat secara luas. Perbedaan mendasar strategi kedua organisasi ini adalah...",
        "explanation": "Budi Utomo bersifat elitis (bangsawan/priyayi) dan kedaerahan (Jawa-Madura). Sarekat Islam bersifat populis, berbasis ekonomi kerakyatan dan agama, sehingga lebih mudah diterima oleh rakyat jelata di berbagai daerah.",
        "options": [
          { "key": "A", "text": "Budi Utomo bergerak di bidang politik, Sarekat Islam di bidang budaya.", "score": 0 },
          { "key": "B", "text": "Budi Utomo bersifat radikal, Sarekat Islam bersifat kooperatif.", "score": 0 },
          { "key": "C", "text": "Budi Utomo berbasis priyayi Jawa, Sarekat Islam berbasis kerakyatan dan ekonomi.", "score": 5 },
          { "key": "D", "text": "Budi Utomo menolak kerjasama dengan Belanda, Sarekat Islam mendukung Belanda.", "score": 0 },
          { "key": "E", "text": "Budi Utomo dipimpin tokoh agama, Sarekat Islam dipimpin mahasiswa.", "score": 0 }
        ]
      },
      {
        "id": "P4-TWK-24",
        "category": "TWK",
        "text": "Penulisan kata depan 'di' dan awalan 'di-' yang BENAR terdapat pada kalimat...",
        "explanation": "Kata depan (preposisi) dipisah jika menunjukkan tempat/arah (di kantor, di sana). Awalan (prefiks) disambung jika membentuk kata kerja pasif (dilihat, dimakan). Opsi C benar: 'di mana' (tempat, dipisah) dan 'diabaikan' (kata kerja, disambung).",
        "options": [
          { "key": "A", "text": "Buku itu diletakkan dimeja oleh adik.", "score": 0 },
          { "key": "B", "text": "Kami akan pergi ke luar negeri di bulan depan.", "score": 0 },
          { "key": "C", "text": "Di mana pun kita berada, aturan tidak boleh diabaikan.", "score": 5 },
          { "key": "D", "text": "Sampah itu dibuang ditempat sampah.", "score": 0 },
          { "key": "E", "text": "Ia dilahirkan dibulan Agustus.", "score": 0 }
        ]
      },
      {
        "id": "P4-TWK-25",
        "category": "TWK",
        "text": "Perhatikan kalimat berikut:\n'Pemerintah yang telah berusaha keras meningkatkan pertumbuhan ekonomi nasional melalui berbagai paket kebijakan strategis selama lima tahun terakhir, kini mulai melihat hasil yang positif.'\nInti kalimat (Core Subject + Core Predicate) dari kalimat luas tersebut adalah...",
        "explanation": "Analisis Sintaksis: Subjek Inti = Pemerintah. Predikat Inti = mulai melihat. Objek Inti = hasil. Keterangan (yang telah berusaha... terakhir) adalah perluasan subjek. Keterangan (yang positif) adalah perluasan objek.",
        "options": [
          { "key": "A", "text": "Pemerintah berusaha keras meningkatkan pertumbuhan ekonomi.", "score": 0 },
          { "key": "B", "text": "Pemerintah mengeluarkan paket kebijakan strategis.", "score": 0 },
          { "key": "C", "text": "Pemerintah mulai melihat hasil.", "score": 5 },
          { "key": "D", "text": "Pertumbuhan ekonomi nasional mulai positif.", "score": 0 },
          { "key": "E", "text": "Hasil positif terlihat selama lima tahun terakhir.", "score": 0 }
        ]
      },
      {
        "id": "P4-TWK-26",
        "category": "TWK",
        "text": "Konferensi Asia Afrika (KAA) 1955 di Bandung menghasilkan Dasasila Bandung yang mengubah peta politik dunia. Dampak politis paling signifikan dari KAA bagi politik internasional adalah...",
        "explanation": "KAA memicu lahirnya Gerakan Non-Blok (GNB) dan mempercepat proses dekolonisasi (kemerdekaan) negara-negara di Asia dan Afrika yang masih dijajah, mengurangi polarisasi Perang Dingin.",
        "options": [
          { "key": "A", "text": "Berakhirnya Perang Dingin antara Blok Barat dan Blok Timur.", "score": 0 },
          { "key": "B", "text": "Indonesia diangkat menjadi pemimpin tetap PBB.", "score": 0 },
          { "key": "C", "text": "Munculnya kekuatan ketiga (Non-Blok) dan percepatan kemerdekaan bangsa Asia-Afrika.", "score": 5 },
          { "key": "D", "text": "Terbentuknya aliansi militer negara-negara Asia.", "score": 0 },
          { "key": "E", "text": "Jepang dan Jerman kembali menjadi kekuatan militer dunia.", "score": 0 }
        ]
      },
      {
        "id": "P4-TWK-27",
        "category": "TWK",
        "text": "Penulisan huruf miring yang TEPAT sesuai PUEBI terdapat pada kalimat...",
        "explanation": "Huruf miring digunakan untuk: 1. Judul buku/majalah/koran. 2. Istilah asing/daerah. 3. Menegaskan kata. Opsi D benar karena 'reshuffle' adalah istilah asing. Opsi A salah (nama instansi tidak miring). Opsi B salah (nama diri tidak miring).",
        "options": [
          { "key": "A", "text": "Ia bekerja di surat kabar *Kompas* sebagai editor.", "score": 0 },
          { "key": "B", "text": "Nama ilmiah padi adalah *Oryza Sativa*.", "score": 0 },
          { "key": "C", "text": "Kita harus menghormati asas *Bhinneka Tunggal Ika*.", "score": 0 },
          { "key": "D", "text": "Isu tentang *reshuffle* kabinet kembali mencuat.", "score": 5 },
          { "key": "E", "text": "Ibu sedang membaca novel *Laskar Pelangi* karya Andrea Hirata.", "score": 0 }
        ]
      },
      {
        "id": "P4-TWK-28",
        "category": "TWK",
        "text": "Kegagalan LBB (Liga Bangsa-Bangsa) menjaga perdamaian dunia menjadi pelajaran bagi pembentukan PBB. Peran Indonesia dalam menjaga perdamaian dunia di bawah bendera PBB diwujudkan melalui pengiriman...",
        "explanation": "Kontingen Garuda (Konga) adalah pasukan pemelihara perdamaian (peacekeeping force) yang dikirim Indonesia ke berbagai negara konflik di bawah mandat PBB.",
        "options": [
          { "key": "A", "text": "Pasukan Nuklir.", "score": 0 },
          { "key": "B", "text": "Kontingen Garuda.", "score": 5 },
          { "key": "C", "text": "Duta Besar Keliling.", "score": 0 },
          { "key": "D", "text": "Bantuan Logistik Pangan semata.", "score": 0 },
          { "key": "E", "text": "Relawan Palang Merah.", "score": 0 }
        ]
      },
      {
        "id": "P4-TWK-29",
        "category": "TWK",
        "text": "Perundingan Linggarjati (1947) mengakibatkan jatuhnya Kabinet Sjahrir. Alasan utama golongan oposisi (seperti PNI dan Masyumi) menolak hasil perundingan tersebut adalah...",
        "explanation": "Linggarjati mengakui wilayah RI secara de facto hanya meliputi Jawa, Sumatera, dan Madura. Hal ini dianggap sangat merugikan dan mempersempit wilayah kedaulatan RI, serta menjadi langkah mundur dari cita-cita proklamasi.",
        "options": [
          { "key": "A", "text": "Sjahrir dianggap terlalu pro-Belanda.", "score": 0 },
          { "key": "B", "text": "Wilayah RI menjadi sangat sempit (hanya Jawa, Sumatera, Madura).", "score": 5 },
          { "key": "C", "text": "Belanda menolak mengakui kemerdekaan Indonesia.", "score": 0 },
          { "key": "D", "text": "TNI tidak dilibatkan dalam perundingan.", "score": 0 },
          { "key": "E", "text": "Rusia memveto hasil perundingan tersebut.", "score": 0 }
        ]
      },
      {
        "id": "P4-TWK-30",
        "category": "TWK",
        "text": "Kesimpulan Logis: 'Semua peserta yang lulus SKD berhak mengikuti SKB. Sebagian peserta yang lulus SKD memiliki sertifikat pendidik. Badu lulus SKD dan memiliki sertifikat pendidik.' Kesimpulan yang sah adalah...",
        "explanation": "Premis 1: Lulus SKD -> Ikut SKB. Premis 2: Badu lulus SKD. Maka Badu berhak ikut SKB. Fakta tambahan 'punya serdik' tidak menggugurkan hak SKB-nya.",
        "options": [
          { "key": "A", "text": "Badu tidak perlu mengikuti SKB.", "score": 0 },
          { "key": "B", "text": "Badu berhak mengikuti SKB.", "score": 5 },
          { "key": "C", "text": "Sebagian peserta SKB adalah Badu.", "score": 0 },
          { "key": "D", "text": "Peserta yang memiliki sertifikat pendidik pasti lulus SKD.", "score": 0 },
          { "key": "E", "text": "Badu lulus karena memiliki sertifikat pendidik.", "score": 0 }
        ]
      },
      {
        "id": "P4-TIU-31",
        "category": "TIU",
        "text": "Analogi Tiga Kata:\nGANDUM : TEPUNG : ROTI = ... : ... : ...",
        "explanation": "Hubungan: Bahan Mentah -> Bahan Setengah Jadi -> Barang Jadi. Gandum diolah menjadi tepung, tepung diolah menjadi roti. Pola yang sama: KAPAS (Mentah) -> BENANG (Setengah Jadi) -> KAIN (Barang Jadi). Opsi A salah karena Beras dimasak langsung jadi Nasi (tidak ada proses intermediate yang signifikan merubah bentuk fisik seperti tepung).",
        "options": [
          { "key": "A", "text": "PADI : BERAS : NASI", "score": 0 },
          { "key": "B", "text": "KAPAS : BENANG : KAIN", "score": 5 },
          { "key": "C", "text": "EMAS : CINCIN : PERHIASAN", "score": 0 },
          { "key": "D", "text": "SUSU : KEJU : SAPI", "score": 0 },
          { "key": "E", "text": "KERTAS : BUKU : TULISAN", "score": 0 }
        ]
      },
      {
        "id": "P4-TIU-32",
        "category": "TIU",
        "text": "Analogi Hubungan:\nAPOTEKER : OBAT = ... : ...",
        "explanation": "Hubungan: Profesi dan Produk yang diracik/dibuat secara keahlian khusus. Apoteker meracik obat. Pilihan B (KOKI : MASAKAN) paling tepat karena Koki meracik/memasak masakan. Dokter memeriksa pasien (bukan membuat), Guru menggunakan spidol (alat), Penulis mengirim ke penerbit.",
        "options": [
          { "key": "A", "text": "DOKTER : PASIEN", "score": 0 },
          { "key": "B", "text": "KOKI : MASAKAN", "score": 5 },
          { "key": "C", "text": "GURU : SPIDOL", "score": 0 },
          { "key": "D", "text": "PENULIS : PENERBIT", "score": 0 },
          { "key": "E", "text": "PENGACARA : HAKIM", "score": 0 }
        ]
      },
      {
        "id": "P4-TIU-33",
        "category": "TIU",
        "text": "Silogisme (Kuantor):\nSemua anggota BEM adalah mahasiswa berprestasi.\nSebagian mahasiswa berprestasi mendapatkan beasiswa.\nKesimpulan yang sah adalah...",
        "explanation": "P = Anggota BEM, Q = Berprestasi, R = Dapat Beasiswa. \nPremis 1: Semua P adalah Q. \nPremis 2: Sebagian Q adalah R. \nKesimpulan TIDAK BISA 'Sebagian P adalah R' karena bisa saja yang dapat beasiswa itu mahasiswa berprestasi yang BUKAN anggota BEM. \nKesimpulan yang pasti benar adalah membalik Premis 2: Sebagian yang mendapatkan beasiswa (R) adalah mahasiswa berprestasi (Q).",
        "options": [
          { "key": "A", "text": "Semua anggota BEM mendapatkan beasiswa.", "score": 0 },
          { "key": "B", "text": "Sebagian anggota BEM mendapatkan beasiswa.", "score": 0 },
          { "key": "C", "text": "Sebagian yang mendapatkan beasiswa adalah anggota BEM.", "score": 0 },
          { "key": "D", "text": "Tidak ada anggota BEM yang mendapatkan beasiswa.", "score": 0 },
          { "key": "E", "text": "Sebagian yang mendapatkan beasiswa adalah mahasiswa berprestasi.", "score": 5 }
        ]
      },
      {
        "id": "P4-TIU-34",
        "category": "TIU",
        "text": "Silogisme (Modus Tollens):\nJika hari ini hujan deras, maka jalanan protokol banjir.\nJalanan protokol tidak banjir.\nSimpulan...",
        "explanation": "Premis 1: p -> q. \nPremis 2: ~q (Negasi q). \nKesimpulan: ~p (Negasi p). \nJika akibat tidak terjadi, maka sebab pasti tidak terjadi. Jadi, Hari ini TIDAK hujan deras.",
        "options": [
          { "key": "A", "text": "Hari ini hujan rintik-rintik.", "score": 0 },
          { "key": "B", "text": "Hari ini tidak hujan deras.", "score": 5 },
          { "key": "C", "text": "Jalanan protokol macet.", "score": 0 },
          { "key": "D", "text": "Hari ini cerah berawan.", "score": 0 },
          { "key": "E", "text": "Tidak dapat ditarik kesimpulan.", "score": 0 }
        ]
      },
      {
        "id": "P4-TIU-35",
        "category": "TIU",
        "text": "Analitis (Urutan Posisi):\nDalam antrian tiket, A ada di belakang B. C ada di depan B. D ada di belakang A. E ada di depan C. Siapakah yang berada pada urutan ketiga?",
        "explanation": "Susun urutan dari depan ke belakang:\n1. A di belakang B -> B - A\n2. C di depan B -> C - B - A\n3. D di belakang A -> C - B - A - D\n4. E di depan C -> E - C - B - A - D\nUrutan: E (1), C (2), B (3), A (4), D (5). Urutan ketiga adalah B.",
        "options": [
          { "key": "A", "text": "A", "score": 0 },
          { "key": "B", "text": "B", "score": 5 },
          { "key": "C", "text": "C", "score": 0 },
          { "key": "D", "text": "D", "score": 0 },
          { "key": "E", "text": "E", "score": 0 }
        ]
      },
      {
        "id": "P4-TIU-36",
        "category": "TIU",
        "text": "Numerik Berhitung Cepat (Aljabar):\nJika x = 2024² - 2023² dan y = 2024 + 2023, maka hubungan x dan y adalah...",
        "explanation": "Gunakan rumus selisih kuadrat: a² - b² = (a-b)(a+b). \nNilai x = (2024-2023)(2024+2023) = (1)(4047) = 4047.\nNilai y = 2024 + 2023 = 4047.\nJadi x = y.",
        "options": [
          { "key": "A", "text": "x > y", "score": 0 },
          { "key": "B", "text": "x < y", "score": 0 },
          { "key": "C", "text": "x = y", "score": 5 },
          { "key": "D", "text": "x = 2y", "score": 0 },
          { "key": "E", "text": "Hubungan x dan y tidak dapat ditentukan.", "score": 0 }
        ]
      },
      {
        "id": "P4-TIU-37",
        "category": "TIU",
        "text": "Numerik Pecahan Istimewa:\nBerapakah 87,5% dari 64?",
        "explanation": "Hafalkan pecahan istimewa: 87,5% = 7/8.\nMaka: 7/8 x 64 = 7 x 8 = 56.",
        "options": [
          { "key": "A", "text": "48", "score": 0 },
          { "key": "B", "text": "52", "score": 0 },
          { "key": "C", "text": "54", "score": 0 },
          { "key": "D", "text": "56", "score": 5 },
          { "key": "E", "text": "58", "score": 0 }
        ]
      },
      {
        "id": "P4-TIU-38",
        "category": "TIU",
        "text": "Deret Angka:\n4, 100, 8, 95, 16, 90, ..., ...",
        "explanation": "Pola Loncata Satu (Larik Ganda):\nLarik 1 (Ganjil): 4, 8, 16 (Kali 2) -> Selanjutnya 16 x 2 = 32.\nLarik 2 (Genap): 100, 95, 90 (Kurang 5) -> Selanjutnya 90 - 5 = 85.\nJawaban: 32, 85.",
        "options": [
          { "key": "A", "text": "32, 85", "score": 5 },
          { "key": "B", "text": "24, 85", "score": 0 },
          { "key": "C", "text": "32, 80", "score": 0 },
          { "key": "D", "text": "20, 85", "score": 0 },
          { "key": "E", "text": "24, 80", "score": 0 }
        ]
      },
      {
        "id": "P4-TIU-39",
        "category": "TIU",
        "text": "Deret Huruf:\nA, C, E, G, ...",
        "explanation": "Pola loncat huruf: A (+2) -> C (+2) -> E (+2) -> G (+2) -> I.\nUrutan abjad: A, b, C, d, E, f, G, h, I.",
        "options": [
          { "key": "A", "text": "H", "score": 0 },
          { "key": "B", "text": "I", "score": 5 },
          { "key": "C", "text": "J", "score": 0 },
          { "key": "D", "text": "K", "score": 0 },
          { "key": "E", "text": "L", "score": 0 }
        ]
      },
      {
        "id": "P4-TIU-40",
        "category": "TIU",
        "text": "Perbandingan Kuantitatif:\nJika A = 25% dari 40 dan B = √100, maka...",
        "explanation": "Hitung nilai A: 25/100 x 40 = 1/4 x 40 = 10.\nHitung nilai B: √100 = 10.\nMaka A = B.",
        "options": [
          { "key": "A", "text": "A > B", "score": 0 },
          { "key": "B", "text": "A < B", "score": 0 },
          { "key": "C", "text": "A = B", "score": 5 },
          { "key": "D", "text": "A = 2B", "score": 0 },
          { "key": "E", "text": "Hubungan tidak dapat ditentukan", "score": 0 }
        ]
      },
      {
        "id": "P4-TIU-41",
        "category": "TIU",
        "text": "Soal Cerita (Perbandingan Berbalik Nilai):\nProyek direncanakan selesai 30 hari oleh 15 pekerja. Jika ingin selesai dalam 25 hari, berapa TAMBAHAN pekerja?",
        "explanation": "Beban kerja = 30 hari x 15 orang = 450.\nTarget baru = 25 hari.\nJumlah pekerja total = 450 / 25 = 18 orang.\nTambahan = 18 - 15 = 3 orang.",
        "options": [
          { "key": "A", "text": "3 orang", "score": 5 },
          { "key": "B", "text": "4 orang", "score": 0 },
          { "key": "C", "text": "5 orang", "score": 0 },
          { "key": "D", "text": "18 orang", "score": 0 },
          { "key": "E", "text": "20 orang", "score": 0 }
        ]
      },
      {
        "id": "P4-TIU-42",
        "category": "TIU",
        "text": "Soal Cerita (Kecepatan Gabungan):\nAndi mengecat tembok dalam 3 jam. Budi mengecat tembok yang sama dalam 6 jam. Jika dikerjakan bersama-sama, berapa lama selesai?",
        "explanation": "Rumus cepat: (A x B) / (A + B).\nWaktu = (3 x 6) / (3 + 6) = 18 / 9 = 2 jam.",
        "options": [
          { "key": "A", "text": "1,5 jam", "score": 0 },
          { "key": "B", "text": "2 jam", "score": 5 },
          { "key": "C", "text": "2,5 jam", "score": 0 },
          { "key": "D", "text": "3 jam", "score": 0 },
          { "key": "E", "text": "4,5 jam", "score": 0 }
        ]
      },
      {
        "id": "P4-TIU-43",
        "category": "TIU",
        "text": "Soal Cerita (Himpunan):\nDi kelas ada 40 siswa. 25 siswa suka Matematika, 20 siswa suka Fisika, 5 siswa tidak suka keduanya. Berapa siswa yang suka keduanya?",
        "explanation": "Rumus: Total = (Suka A + Suka B) - Suka Keduanya + Tidak Suka Keduanya.\n40 = (25 + 20) - X + 5\n40 = 45 - X + 5\n40 = 50 - X\nX = 10 siswa.",
        "options": [
          { "key": "A", "text": "5 siswa", "score": 0 },
          { "key": "B", "text": "10 siswa", "score": 5 },
          { "key": "C", "text": "15 siswa", "score": 0 },
          { "key": "D", "text": "20 siswa", "score": 0 },
          { "key": "E", "text": "25 siswa", "score": 0 }
        ]
      },
      {
        "id": "P4-TIU-44",
        "category": "TIU",
        "text": "Soal Cerita (Aritmatika Sosial):\nBudi membeli sepatu Rp200.000 dan dijual kembali dengan untung 15%. Berapa harga jual sepatu?",
        "explanation": "Untung = 15% x 200.000 = 30.000.\nHarga Jual = Modal + Untung = 200.000 + 30.000 = Rp230.000.",
        "options": [
          { "key": "A", "text": "Rp215.000", "score": 0 },
          { "key": "B", "text": "Rp220.000", "score": 0 },
          { "key": "C", "text": "Rp225.000", "score": 0 },
          { "key": "D", "text": "Rp230.000", "score": 5 },
          { "key": "E", "text": "Rp235.000", "score": 0 }
        ]
      },
      {
        "id": "P4-TIU-45",
        "category": "TIU",
        "text": "Figural Analogi: Perhatikan perubahan dari Gambar 1 ke 2. Terapkan pada Gambar 3!",
        "svgCode": "<svg viewBox='0 0 800 450' xmlns='http://www.w3.org/2000/svg'><style>text{font-family:sans-serif;fill:white;font-size:30px;font-weight:bold;text-anchor:middle}.s{stroke:white;stroke-width:3;fill:none}.d{stroke-dasharray:5,5}</style><g transform='translate(200,80)'><rect x='-20' y='-20' width='40' height='40' class='s'/><text x='50' y='10'>-></text><rect x='100' y='-20' width='40' height='40' class='s'/><line x1='100' y1='-20' x2='140' y2='20' class='s'/><line x1='140' y1='-20' x2='100' y2='20' class='s'/><text x='180' y='10'>::</text><circle cx='240' cy='0' r='20' class='s'/><text x='290' y='10'>-></text><text x='340' y='10' fill='#f97316'>?</text></g><line x1='0' y1='230' x2='800' y2='230' class='s d'/><g transform='translate(80, 340)'><text x='0' y='-50' font-size='20'>A</text><circle cx='0' cy='0' r='20' class='s'/><line x1='0' y1='-20' x2='0' y2='20' class='s'/></g><g transform='translate(240, 340)'><text x='0' y='-50' font-size='20'>B</text><circle cx='0' cy='0' r='20' class='s'/><line x1='-14' y1='-14' x2='14' y2='14' class='s'/><line x1='14' y1='-14' x2='-14' y2='14' class='s'/></g><g transform='translate(400, 340)'><text x='0' y='-50' font-size='20'>C</text><circle cx='0' cy='0' r='20' class='s' fill='white'/></g><g transform='translate(560, 340)'><text x='0' y='-50' font-size='20'>D</text><circle cx='0' cy='0' r='20' class='s'/><circle cx='0' cy='0' r='5' fill='white'/></g><g transform='translate(720, 340)'><text x='0' y='-50' font-size='20'>E</text><rect x='-20' y='-20' width='40' height='40' class='s'/><line x1='-20' y1='-20' x2='20' y2='20' class='s'/><line x1='20' y1='-20' x2='-20' y2='20' class='s'/></g></svg>",
        "explanation": "LOGIKA PENGISIAN:\n1. Pola: Bangun Kosong -> Bangun diisi Tanda Silang (X).\n2. Soal: Lingkaran Kosong -> Harus menjadi Lingkaran berisi Tanda Silang.\nJawaban: B.",
        "options": [
          { "key": "A", "text": "Gambar A", "score": 0 },
          { "key": "B", "text": "Gambar B", "score": 5 },
          { "key": "C", "text": "Gambar C", "score": 0 },
          { "key": "D", "text": "Gambar D", "score": 0 },
          { "key": "E", "text": "Gambar E", "score": 0 }
        ]
      },
      {
        "id": "P4-TIU-46",
        "category": "TIU",
        "text": "Figural Ketidaksamaan (Odd One Out): Manakah gambar yang memiliki pola berbeda?",
        "svgCode": "<svg viewBox='0 0 800 450' xmlns='http://www.w3.org/2000/svg'><style>text{font-family:sans-serif;fill:white;font-size:20px;font-weight:bold;text-anchor:middle}.s{stroke:white;stroke-width:3;fill:none}.d{stroke-dasharray:5,5}</style><g transform='translate(400,100)'><text x='0' y='0' fill='#f97316' font-size='30'>CARI YANG BERBEDA!</text><text x='0' y='40'>(Rotasi vs Cermin)</text></g><line x1='0' y1='230' x2='800' y2='230' class='s d'/><g transform='translate(80, 340)'><text x='0' y='-50'>A</text><text x='0' y='20' font-size='50'>F</text></g><g transform='translate(240, 340)'><text x='0' y='-50'>B</text><text x='0' y='20' font-size='50' transform='rotate(90)'>F</text></g><g transform='translate(400, 340)'><text x='0' y='-50'>C</text><text x='0' y='20' font-size='50' transform='scale(-1,1)'>F</text></g><g transform='translate(560, 340)'><text x='0' y='-50'>D</text><text x='0' y='20' font-size='50' transform='rotate(180)'>F</text></g><g transform='translate(720, 340)'><text x='0' y='-50'>E</text><text x='0' y='20' font-size='50' transform='rotate(270)'>F</text></g></svg>",
        "explanation": "ANALISIS ROTASI VS REFLEKSI:\n1. Opsi A, B, D, E adalah Huruf F normal yang diputar (Rotasi).\n2. Opsi C adalah Huruf F terbalik (Pencerminan/Mirror). Tidak akan pernah sama dengan yang lain walau diputar.\nJawaban: C adalah outlier.",
        "options": [
          { "key": "A", "text": "Gambar A", "score": 0 },
          { "key": "B", "text": "Gambar B", "score": 0 },
          { "key": "C", "text": "Gambar C", "score": 5 },
          { "key": "D", "text": "Gambar D", "score": 0 },
          { "key": "E", "text": "Gambar E", "score": 0 }
        ]
      },
      {
        "id": "P4-TIU-47",
        "category": "TIU",
        "text": "Figural Serial: Tentukan gambar selanjutnya pada urutan ke-4.",
        "svgCode": "<svg viewBox='0 0 800 450' xmlns='http://www.w3.org/2000/svg'><style>text{font-family:sans-serif;fill:white;font-size:20px;font-weight:bold;text-anchor:middle}.s{stroke:white;stroke-width:3;fill:none}.d{stroke-dasharray:5,5}</style><g transform='translate(100,60)'><rect x='0' y='0' width='60' height='60' class='s'/><line x1='30' y1='0' x2='30' y2='60' class='s'/><g transform='translate(80,0)'><rect x='0' y='0' width='60' height='60' class='s'/><line x1='30' y1='0' x2='30' y2='60' class='s'/><line x1='0' y1='30' x2='60' y2='30' class='s'/></g><g transform='translate(160,0)'><rect x='0' y='0' width='60' height='60' class='s'/><line x1='30' y1='0' x2='30' y2='60' class='s'/><line x1='0' y1='30' x2='60' y2='30' class='s'/><line x1='0' y1='0' x2='60' y2='60' class='s'/></g><g transform='translate(240,0)'><rect x='0' y='0' width='60' height='60' stroke='#f97316' fill='none' stroke-width='3'/><text x='30' y='35' fill='#f97316' font-size='30'>?</text></g></g><line x1='0' y1='230' x2='800' y2='230' class='s d'/><g transform='translate(80, 340)'><text x='0' y='-50'>A</text><rect x='-20' y='-20' width='40' height='40' class='s'/><line x1='0' y1='-20' x2='0' y2='20' class='s'/></g><g transform='translate(240, 340)'><text x='0' y='-50'>B</text><rect x='-20' y='-20' width='40' height='40' class='s'/><line x1='0' y1='-20' x2='0' y2='20' class='s'/><line x1='-20' y1='0' x2='20' y2='0' class='s'/><line x1='-20' y1='-20' x2='20' y2='20' class='s'/><line x1='20' y1='-20' x2='-20' y2='20' class='s'/></g><g transform='translate(400, 340)'><text x='0' y='-50'>C</text><rect x='-20' y='-20' width='40' height='40' class='s' fill='white'/></g><g transform='translate(560, 340)'><text x='0' y='-50'>D</text><circle cx='0' cy='0' r='20' class='s'/></g><g transform='translate(720, 340)'><text x='0' y='-50'>E</text><rect x='-20' y='-20' width='40' height='40' class='s'/><line x1='-20' y1='-20' x2='20' y2='20' class='s'/><line x1='20' y1='-20' x2='-20' y2='20' class='s'/></g></svg>",
        "explanation": "POLA PENAMBAHAN GARIS:\n1. Gambar 1: 1 Garis (Vertikal).\n2. Gambar 2: 2 Garis (+ Horizontal).\n3. Gambar 3: 3 Garis (+ Diagonal Kiri).\n4. Gambar 4: HARUS 4 Garis (+ Diagonal Kanan). Membentuk pola 'Union Jack' (Bintang 8 arah).\nJawaban: B.",
        "options": [
          { "key": "A", "text": "Gambar A", "score": 0 },
          { "key": "B", "text": "Gambar B", "score": 5 },
          { "key": "C", "text": "Gambar C", "score": 0 },
          { "key": "D", "text": "Gambar D", "score": 0 },
          { "key": "E", "text": "Gambar E", "score": 0 }
        ]
      },
      {
        "id": "P4-TIU-48",
        "category": "TIU",
        "text": "Figural Jaring-Jaring Kubus: Sisi manakah yang berhadapan dengan sisi 'D'?",
        "svgCode": "<svg viewBox='0 0 800 450' xmlns='http://www.w3.org/2000/svg'><style>text{font-family:sans-serif;fill:white;font-size:20px;font-weight:bold;text-anchor:middle}.s{stroke:white;stroke-width:2;fill:none}.d{stroke-dasharray:5,5}</style><g transform='translate(350,20)'><rect x='50' y='0' width='40' height='40' class='s'/><rect x='50' y='40' width='40' height='40' class='s'/><text x='70' y='65'>HITAM</text><rect x='50' y='80' width='40' height='40' class='s'/><text x='70' y='105'>A</text><rect x='10' y='40' width='40' height='40' class='s'/><text x='30' y='65'>B</text><rect x='90' y='40' width='40' height='40' class='s'/><text x='110' y='65'>C</text><rect x='130' y='40' width='40' height='40' class='s'/><text x='150' y='65'>D</text></g><line x1='0' y1='230' x2='800' y2='230' class='s d'/><g transform='translate(80, 330)'><text x='0' y='-50'>A</text><text x='0' y='10'>A</text></g><g transform='translate(240, 330)'><text x='0' y='-50'>B</text><text x='0' y='10'>B</text></g><g transform='translate(400, 330)'><text x='0' y='-50'>C</text><text x='0' y='10'>C</text></g><g transform='translate(560, 330)'><text x='0' y='-50'>D</text><text x='0' y='10'>HITAM</text></g><g transform='translate(720, 330)'><text x='0' y='-50'>E</text><text x='0' y='10'>KOSONG</text></g></svg>",
        "explanation": "PRINSIP SISI BERHADAPAN (LONGKAP SATU):\n1. Baris Horizontal: [B] - [HITAM] - [C] - [D].\n2. Sisi berhadapan dipisahkan 1 sisi lain.\n3. [B] berhadapan dengan [C].\n4. [HITAM] berhadapan dengan [D].\nJawaban: Sisi Hitam.",
        "options": [
          { "key": "A", "text": "Pilihan A", "score": 0 },
          { "key": "B", "text": "Pilihan B", "score": 0 },
          { "key": "C", "text": "Pilihan C", "score": 0 },
          { "key": "D", "text": "Pilihan D", "score": 5 },
          { "key": "E", "text": "Pilihan E", "score": 0 }
        ]
      },
      {
        "id": "P4-TIU-49",
        "category": "TIU",
        "text": "Analogi Tiga Kata:\nKAKI : SEPATU : KAOS KAKI = ... : ... : ...",
        "explanation": "Hubungan: Anggota Tubuh : Pelindung Luar : Pelapis Dalam. Kaki dilindungi sepatu, didalamnya pakai kaos kaki. Pola yang sama: TANGAN : SARUNG TANGAN : (Tidak ada pelapis dalam umum). Cek opsi lain. Opsi C: TUBUH : JAKET : KAOS (Tubuh dilindungi Jaket, didalamnya pakai Kaos).",
        "options": [
          { "key": "A", "text": "KEPALA : TOPI : RAMBUT", "score": 0 },
          { "key": "B", "text": "MATA : KACAMATA : ALIS", "score": 0 },
          { "key": "C", "text": "TUBUH : JAKET : KAOS", "score": 5 },
          { "key": "D", "text": "JARI : CINCIN : KUKU", "score": 0 },
          { "key": "E", "text": "TELINGA : ANTING : DAUN TELINGA", "score": 0 }
        ]
      },
      {
        "id": "P4-TIU-50",
        "category": "TIU",
        "text": "Analitis (Posisi Meja Bundar):\n6 orang (A,B,C,D,E,F) duduk melingkar. A berhadapan dengan D. B duduk di antara A dan F. C duduk tepat di sebelah kiri D. Siapakah yang duduk di sebelah kanan A?",
        "explanation": "Susun: \n1. A berhadapan D.\n2. B antara A dan F? Bisa (A-B-F). \n3. C kiri D. (Ingat D menghadap pusat, kirinya D ada di sisi kanan gambar jika dilihat dari atas). Urutan melingkar searah jarum jam: A - ... - D - C.\nMari plot: \nPosisi jam 12: A.\nPosisi jam 6: D.\nC kiri D (jam 4-5): C.\nB antara A dan F. Jika F di jam 2, B di jam 1. \nSisa E di jam 7-8. \nCek 'Kanan A'. A menghadap pusat. Kanan A adalah arah jam 11-10. Di diagram tadi urutan CCW: A - B - F - C - D - E. Kanan A (sebelah kiri di gambar jam) adalah E? \nMari visualisasi standar: \nA (Bawah) hadap D (Atas).\nC kiri D (Berarti C di Kanan Atas).\nB antara A dan F. \nJika urutan A-B-F-D-C-E. \nKanan A adalah E.",
        "options": [
          { "key": "A", "text": "B", "score": 0 },
          { "key": "B", "text": "C", "score": 0 },
          { "key": "C", "text": "D", "score": 0 },
          { "key": "D", "text": "E", "score": 5 },
          { "key": "E", "text": "F", "score": 0 }
        ]
      },
      {
        "id": "P4-TIU-51",
        "category": "TIU",
        "text": "Figural Serial: Tentukan posisi titik pada langkah selanjutnya!",
        "svgCode": "<svg viewBox='0 0 800 450' xmlns='http://www.w3.org/2000/svg'><style>text{font-family:sans-serif;fill:white;font-size:20px;font-weight:bold;text-anchor:middle}.s{stroke:white;stroke-width:2;fill:none}.d{stroke-dasharray:5,5}</style><g transform='translate(150,60)'><rect x='0' y='0' width='60' height='60' class='s'/><circle cx='15' cy='15' r='5' fill='white'/><g transform='translate(80,0)'><rect x='0' y='0' width='60' height='60' class='s'/><circle cx='45' cy='15' r='5' fill='white'/></g><g transform='translate(160,0)'><rect x='0' y='0' width='60' height='60' class='s'/><circle cx='45' cy='45' r='5' fill='white'/></g><g transform='translate(240,0)'><rect x='0' y='0' width='60' height='60' stroke='#f97316' fill='none' stroke-width='3'/><text x='30' y='35' fill='#f97316' font-size='30'>?</text></g></g><line x1='0' y1='230' x2='800' y2='230' class='s d'/><g transform='translate(80, 340)'><text x='0' y='-50'>A</text><rect x='-20' y='-20' width='40' height='40' class='s'/><circle cx='-10' cy='-10' r='5' fill='white'/></g><g transform='translate(240, 340)'><text x='0' y='-50'>B</text><rect x='-20' y='-20' width='40' height='40' class='s'/><circle cx='10' cy='-10' r='5' fill='white'/></g><g transform='translate(400, 340)'><text x='0' y='-50'>C</text><rect x='-20' y='-20' width='40' height='40' class='s'/><circle cx='10' cy='10' r='5' fill='white'/></g><g transform='translate(560, 340)'><text x='0' y='-50'>D</text><rect x='-20' y='-20' width='40' height='40' class='s'/><circle cx='-10' cy='10' r='5' fill='white'/></g><g transform='translate(720, 340)'><text x='0' y='-50'>E</text><rect x='-20' y='-20' width='40' height='40' class='s'/><circle cx='0' cy='0' r='5' fill='white'/></g></svg>",
        "explanation": "POLA ROTASI SUDUT:\n1. Titik bergerak searah jarum jam.\n2. Urutan: Kiri Atas -> Kanan Atas -> Kanan Bawah -> ...\n3. Langkah selanjutnya: KIRI BAWAH.\nJawaban: D.",
        "options": [
          { "key": "A", "text": "Gambar A", "score": 0 },
          { "key": "B", "text": "Gambar B", "score": 0 },
          { "key": "C", "text": "Gambar C", "score": 0 },
          { "key": "D", "text": "Gambar D", "score": 5 },
          { "key": "E", "text": "Gambar E", "score": 0 }
        ]
      },
      {
        "id": "P4-TIU-52",
        "category": "TIU",
        "text": "Figural Analogi: Terapkan pola perubahan dari Gambar 1 ke 2, untuk Gambar 3 ke 4.",
        "svgCode": "<svg viewBox='0 0 800 450' xmlns='http://www.w3.org/2000/svg'><style>text{font-family:sans-serif;fill:white;font-size:30px;font-weight:bold;text-anchor:middle}.s{stroke:white;stroke-width:3;fill:none}.d{stroke-dasharray:5,5}</style><g transform='translate(200,80)'><path d='M0,20 L0,-20 M-10,-10 L0,-20 L10,-10' class='s'/><text x='50' y='10'>-></text><path d='M100,-20 L100,20 M90,10 L100,20 L110,10' class='s'/><text x='150' y='10'>::</text><path d='M200,-20 L200,20 M200,-20 L220,-20 M200,0 L215,0' class='s'/><text x='250' y='10'>-></text><text x='300' y='10' fill='#f97316'>?</text></g><line x1='0' y1='230' x2='800' y2='230' class='s d'/><g transform='translate(80, 340)'><text x='0' y='-50'>A</text><path d='M0,-20 L0,20 M0,-20 L20,-20 M0,0 L15,0' class='s'/></g><g transform='translate(240, 340)'><text x='0' y='-50'>B</text><path d='M20,-20 L20,20 M20,-20 L0,-20 M20,0 L5,0' class='s'/></g><g transform='translate(400, 340)'><text x='0' y='-50'>C</text><path d='M0,20 L0,-20 M0,20 L20,20 M0,0 L15,0' class='s'/></g><g transform='translate(560, 340)'><text x='0' y='-50'>D</text><path d='M20,20 L20,-20 M20,20 L0,20 M20,0 L5,0' class='s'/></g><g transform='translate(720, 340)'><text x='0' y='-50'>E</text><path d='M0,0 L20,0' class='s'/></g></svg>",
        "explanation": "LOGIKA ROTASI 180 (PEMBALIKAN):\n1. Panah Atas -> Panah Bawah.\n2. Huruf F Tegak -> Harus diputar 180 derajat menjadi Huruf F Terbalik (Kaki di atas, menghadap Kiri).\nJawaban: D.",
        "options": [
          { "key": "A", "text": "Gambar A", "score": 0 },
          { "key": "B", "text": "Gambar B", "score": 0 },
          { "key": "C", "text": "Gambar C", "score": 0 },
          { "key": "D", "text": "Gambar D", "score": 5 },
          { "key": "E", "text": "Gambar E", "score": 0 }
        ]
      },
      {
        "id": "P4-TIU-53",
        "category": "TIU",
        "text": "Figural Jaring-Jaring Kubus: Manakah bentuk kubus yang MUNGKIN terbentuk?",
        "svgCode": "<svg viewBox='0 0 800 450' xmlns='http://www.w3.org/2000/svg'><style>text{font-family:sans-serif;fill:white;font-size:20px;font-weight:bold;text-anchor:middle}.s{stroke:white;stroke-width:2;fill:none}.d{stroke-dasharray:5,5}</style><g transform='translate(350,20)'><rect x='50' y='40' width='40' height='40' class='s'/><circle cx='70' cy='60' r='10' fill='white'/><rect x='50' y='0' width='40' height='40' class='s'/><rect x='50' y='80' width='40' height='40' class='s' fill='white'/><rect x='10' y='40' width='40' height='40' class='s'/><line x1='10' y1='40' x2='50' y2='80' class='s'/><line x1='50' y1='40' x2='10' y2='80' class='s'/><rect x='90' y='40' width='40' height='40' class='s'/><rect x='100' y='50' width='20' height='20' fill='white'/></g><line x1='0' y1='230' x2='800' y2='230' class='s d'/><g transform='translate(80, 320)'><text x='0' y='-50'>A</text><path d='M-25,-25 L25,-25 L50,-5 L50,45 L0,45 L-25,25 Z' class='s'/><line x1='-25' y1='25' x2='25' y2='25' class='s'/><line x1='25' y1='-25' x2='25' y2='25' class='s'/><line x1='25' y1='25' x2='50' y2='45' class='s'/></g><g transform='translate(240, 320)'><text x='0' y='-50'>B</text><path d='M-25,-25 L25,-25 L50,-5 L50,45 L0,45 L-25,25 Z' class='s'/><line x1='-25' y1='25' x2='25' y2='25' class='s'/><line x1='25' y1='-25' x2='25' y2='25' class='s'/><line x1='25' y1='25' x2='50' y2='45' class='s'/><circle cx='0' cy='0' r='5' fill='white'/><path d='M30,-15 L40,-5 L40,-15 L30,-5' class='s'/><path d='M35,30 L45,30 L45,40 L35,40' fill='white'/><path d='M-20,-20 L20,-20 L40,-5 L20,-5 L-20,-5 Z' class='s' fill='white'/><path d='M-20,-5 L20,-5 L20,35 L-20,35 Z' class='s'/><circle cx='0' cy='15' r='5' fill='white'/><path d='M20,-5 L40,-5 L40,35 L20,35 Z' class='s'/><line x1='20' y1='-5' x2='40' y2='35' class='s'/><line x1='40' y1='-5' x2='20' y2='35' class='s'/></g><g transform='translate(400, 320)'><text x='0' y='-50'>C</text><rect x='-25' y='-25' width='50' height='50' class='s'/></g><g transform='translate(560, 320)'><text x='0' y='-50'>D</text><rect x='-25' y='-25' width='50' height='50' class='s'/></g><g transform='translate(720, 320)'><text x='0' y='-50'>E</text><rect x='-25' y='-25' width='50' height='50' class='s'/></g></svg>",
        "explanation": "ANALISIS SISI MUSTAHIL vs MUNGKIN:\n1. Sisi Berlawanan (Musuh): Atas (Kosong) vs Bawah (Putih). Kiri (X) vs Kanan (Kotak).\n2. Opsi B Menampilkan: Putih (Atas), Lingkaran (Depan), Silang (Samping). Ketiga sisi ini BERTETANGGA pada jaring-jaring (membentuk sudut), sehingga MUNGKIN terbentuk.",
        "options": [
          { "key": "A", "text": "Gambar A", "score": 0 },
          { "key": "B", "text": "Gambar B", "score": 5 },
          { "key": "C", "text": "Gambar C", "score": 0 },
          { "key": "D", "text": "Gambar D", "score": 0 },
          { "key": "E", "text": "Gambar E", "score": 0 }
        ]
      },
      {
        "id": "P4-TIU-54",
        "category": "TIU",
        "text": "Figural Matriks 2x2: Tentukan gambar yang hilang untuk melengkapi pola.",
        "svgCode": "<svg viewBox='0 0 800 450' xmlns='http://www.w3.org/2000/svg'><style>text{font-family:sans-serif;fill:white;font-size:20px;font-weight:bold;text-anchor:middle}.s{stroke:white;stroke-width:3;fill:none}.d{stroke-dasharray:5,5}</style><g transform='translate(250,20)'><rect x='10' y='10' width='60' height='60' class='s'/><polygon points='40,20 60,60 20,60' class='s'/><rect x='110' y='10' width='60' height='60' class='s'/><polygon points='140,20 160,60 120,60' class='s'/><circle cx='140' cy='45' r='5' fill='white'/><rect x='10' y='90' width='60' height='60' class='s'/><rect x='25' y='105' width='30' height='30' class='s'/><text x='140' y='130' fill='#f97316' font-size='40'>?</text></g><line x1='0' y1='230' x2='800' y2='230' class='s d'/><g transform='translate(80, 340)'><text x='0' y='-50'>A</text><rect x='-20' y='-20' width='40' height='40' class='s'/></g><g transform='translate(240, 340)'><text x='0' y='-50'>B</text><rect x='-20' y='-20' width='40' height='40' class='s'/><rect x='-10' y='-10' width='20' height='20' class='s'/><circle cx='0' cy='0' r='5' fill='white'/></g><g transform='translate(400, 340)'><text x='0' y='-50'>C</text><rect x='-20' y='-20' width='40' height='40' class='s' fill='white'/></g><g transform='translate(560, 340)'><text x='0' y='-50'>D</text><polygon points='0,-20 20,20 -20,20' class='s'/><circle cx='0' cy='5' r='5' fill='white'/></g><g transform='translate(720, 340)'><text x='0' y='-50'>E</text><rect x='-20' y='-20' width='40' height='40' class='s'/><line x1='-20' y1='-20' x2='20' y2='20' class='s'/></g></svg>",
        "explanation": "POLA PENAMBAHAN ELEMEN:\n1. Kolom Kiri: Bangun Dasar (Luaran + Dalaman).\n2. Kolom Kanan: Bangun Dasar yang sama + TITIK di tengah.\n3. Baris 2: Persegi Besar + Persegi Kecil.\n4. Hasil: Persegi Besar + Persegi Kecil + TITIK.",
        "options": [
          { "key": "A", "text": "Gambar A", "score": 0 },
          { "key": "B", "text": "Gambar B", "score": 5 },
          { "key": "C", "text": "Gambar C", "score": 0 },
          { "key": "D", "text": "Gambar D", "score": 0 },
          { "key": "E", "text": "Gambar E", "score": 0 }
        ]
      },
      {
        "id": "P4-TIU-55",
        "category": "TIU",
        "text": "Deret Angka HOTS:\n2, 3, 5, 8, 12, 17, ..., ...",
        "explanation": "Pola Bertingkat:\n2 ke 3 (+1)\n3 ke 5 (+2)\n5 ke 8 (+3)\n8 ke 12 (+4)\n12 ke 17 (+5)\nPola penambahan selalu naik 1. Maka selanjutnya:\n17 + 6 = 23.\n23 + 7 = 30.",
        "options": [
          { "key": "A", "text": "22, 28", "score": 0 },
          { "key": "B", "text": "23, 29", "score": 0 },
          { "key": "C", "text": "23, 30", "score": 5 },
          { "key": "D", "text": "24, 31", "score": 0 },
          { "key": "E", "text": "25, 32", "score": 0 }
        ]
      },
      {
        "id": "P4-TIU-56",
        "category": "TIU",
        "text": "Perbandingan Kuantitatif:\nDiketahui x = 16,67% dari 30. \nDan y = 1/6 dari 30. \nMaka...",
        "explanation": "Hafalan Pecahan: 16,67% itu sama dengan 1/6.\nMaka x = 1/6 * 30 = 5.\ny = 1/6 * 30 = 5.\nJadi x = y.",
        "options": [
          { "key": "A", "text": "x > y", "score": 0 },
          { "key": "B", "text": "x < y", "score": 0 },
          { "key": "C", "text": "x = y", "score": 5 },
          { "key": "D", "text": "x = 2y", "score": 0 },
          { "key": "E", "text": "Hubungan tidak dapat ditentukan", "score": 0 }
        ]
      },
      {
        "id": "P4-TIU-57",
        "category": "TIU",
        "text": "Analitis (Urutan Usia):\nUmur Andri lebih tua dari Budi. Umur Citra lebih muda dari Budi. Umur Dedi lebih tua dari Andri. Siapakah yang paling muda?",
        "explanation": "Susun pertidaksamaan:\n1. Andri > Budi\n2. Citra < Budi (atau Budi > Citra)\n3. Dedi > Andri\nGabungkan: Dedi > Andri > Budi > Citra.\nYang paling muda (ujung kanan) adalah Citra.",
        "options": [
          { "key": "A", "text": "Andri", "score": 0 },
          { "key": "B", "text": "Budi", "score": 0 },
          { "key": "C", "text": "Citra", "score": 5 },
          { "key": "D", "text": "Dedi", "score": 0 },
          { "key": "E", "text": "Tidak dapat ditentukan", "score": 0 }
        ]
      },
      {
        "id": "P4-TIU-58",
        "category": "TIU",
        "text": "Soal Cerita (Kecepatan Menyusul):\nAndi berangkat pukul 07.00 dengan kecepatan 40 km/jam. Budi berangkat pukul 07.30 menyusul dengan kecepatan 60 km/jam. Pukul berapa Budi menyusul Andi?",
        "explanation": "Selisih Waktu = 30 menit (0,5 jam).\nSelisih Jarak (Gap) = Kecepatan A x Selisih Waktu = 40 x 0,5 = 20 km.\nWaktu Susul = Gap / (V2 - V1) = 20 / (60 - 40) = 20 / 20 = 1 jam.\nBudi menyusul 1 jam setelah dia berangkat (07.30).\n07.30 + 1 jam = 08.30.",
        "options": [
          { "key": "A", "text": "08.00", "score": 0 },
          { "key": "B", "text": "08.15", "score": 0 },
          { "key": "C", "text": "08.30", "score": 5 },
          { "key": "D", "text": "08.45", "score": 0 },
          { "key": "E", "text": "09.00", "score": 0 }
        ]
      },
      {
        "id": "P4-TIU-59",
        "category": "TIU",
        "text": "Pecahan Campuran:\nHasil dari 2 ¼ : 0,5 + 3/4 adalah...",
        "explanation": "Ubah ke pecahan biasa:\n2 1/4 = 9/4.\n0,5 = 1/2.\nOperasi bagi didahulukan: 9/4 : 1/2 = 9/4 x 2/1 = 18/4 = 9/2 = 4,5.\nLalu penjumlahan: 4,5 + 0,75 (3/4) = 5,25.\nAtau pecahan: 9/2 + 3/4 = 18/4 + 3/4 = 21/4 = 5 1/4.",
        "options": [
          { "key": "A", "text": "4,75", "score": 0 },
          { "key": "B", "text": "5,00", "score": 0 },
          { "key": "C", "text": "5,25", "score": 5 },
          { "key": "D", "text": "5,50", "score": 0 },
          { "key": "E", "text": "6,00", "score": 0 }
        ]
      },
      {
        "id": "P4-TIU-60",
        "category": "TIU",
        "text": "Analogi Objek:\nHELM : KEPALA = ... : ...",
        "explanation": "Hubungan: Alat Pelindung : Bagian Tubuh yang Dilindungi. Helm melindungi kepala. Pilihan yang setara adalah KACAMATA : MATA (melindungi mata dari debu/cahaya). Opsi lain salah fungsi (Jam tangan bukan pelindung, Cincin bukan pelindung).",
        "options": [
          { "key": "A", "text": "JAM TANGAN : TANGAN", "score": 0 },
          { "key": "B", "text": "CINCIN : JARI", "score": 0 },
          { "key": "C", "text": "KACAMATA : MATA", "score": 5 },
          { "key": "D", "text": "KALUNG : LEHER", "score": 0 },
          { "key": "E", "text": "SEPATU : TALI", "score": 0 }
        ]
      },
      {
        "id": "P4-TIU-61",
        "category": "TIU",
        "text": "Logika Diagram Venn: Sebagian A adalah B. Semua B adalah C. Manakah diagram yang tepat?",
        "svgCode": "<svg viewBox='0 0 800 450' xmlns='http://www.w3.org/2000/svg'><style>text{font-family:sans-serif;fill:white;font-size:20px;font-weight:bold;text-anchor:middle}.s{stroke:white;stroke-width:3;fill:none}.d{stroke-dasharray:5,5}</style><g transform='translate(400,100)'><text x='0' y='-20' font-size='24'>PREMIS:</text><text x='0' y='20'>1. Sebagian A adalah B.</text><text x='0' y='60'>2. Semua B adalah C.</text></g><line x1='0' y1='230' x2='800' y2='230' class='s d'/><g transform='translate(80, 340)'><text x='0' y='-50'>A</text><circle cx='-15' cy='0' r='15' class='s'/><text x='-15' y='5' font-size='12'>A</text><circle cx='15' cy='0' r='15' class='s'/><text x='15' y='5' font-size='12'>B</text></g><g transform='translate(240, 340)'><text x='0' y='-50'>B</text><circle cx='0' cy='0' r='30' class='s'/><text x='0' y='-20' font-size='12'>C</text><circle cx='5' cy='10' r='12' class='s'/><text x='5' y='15' font-size='12'>B</text><circle cx='-15' cy='10' r='12' class='s'/><text x='-15' y='15' font-size='12'>A</text></g><g transform='translate(400, 340)'><text x='0' y='-50'>C</text><circle cx='0' cy='0' r='30' class='s'/><circle cx='0' cy='0' r='20' class='s'/><circle cx='0' cy='0' r='10' class='s'/></g><g transform='translate(560, 340)'><text x='0' y='-50'>D</text><circle cx='-20' cy='0' r='10' class='s'/><circle cx='20' cy='0' r='10' class='s'/><circle cx='0' cy='-20' r='10' class='s'/></g><g transform='translate(720, 340)'><text x='0' y='-50'>E</text><circle cx='0' cy='0' r='25' class='s'/><text x='0' y='5' font-size='12'>A=B</text></g></svg>",
        "explanation": "LOGIKA HIMPUNAN:\n1. 'Semua B adalah C' -> Lingkaran B ada DI DALAM Lingkaran C.\n2. 'Sebagian A adalah B' -> Lingkaran A beririsan dengan B.\n3. Konsekuensi: Karena B di dalam C, maka A otomatis juga mengiris C.\nJawaban B: Menunjukkan B di dalam C, dan A memotong keduanya.",
        "options": [
          { "key": "A", "text": "Gambar A", "score": 0 },
          { "key": "B", "text": "Gambar B", "score": 5 },
          { "key": "C", "text": "Gambar C", "score": 0 },
          { "key": "D", "text": "Gambar D", "score": 0 },
          { "key": "E", "text": "Gambar E", "score": 0 }
        ]
      },
      {
        "id": "P4-TIU-62",
        "category": "TIU",
        "text": "Figural Pencerminan (Mirror Image): Manakah hasil pencerminan gambar terhadap garis vertikal di kanan?",
        "svgCode": "<svg viewBox='0 0 800 450' xmlns='http://www.w3.org/2000/svg'><style>text{font-family:sans-serif;fill:white;font-size:20px;font-weight:bold;text-anchor:middle}.s{stroke:white;stroke-width:3;fill:none}.d{stroke-dasharray:5,5}</style><g transform='translate(300,50)'><line x1='0' y1='0' x2='0' y2='80' class='s'/><path d='M0,10 L50,30 L0,50 Z' fill='white'/><line x1='80' y1='-10' x2='80' y2='100' class='s d'/><text x='80' y='120'>CERMIN KANAN</text><rect x='110' y='0' width='80' height='80' stroke='#f97316' fill='none' stroke-width='2'/><text x='150' y='50' fill='#f97316' font-size='30'>?</text></g><line x1='0' y1='230' x2='800' y2='230' class='s d'/><g transform='translate(80, 340)'><text x='0' y='-50'>A</text><line x1='-10' y1='-30' x2='-10' y2='30' class='s'/><path d='M-10,-20 L20,0 L-10,20' fill='white'/></g><g transform='translate(240, 340)'><text x='0' y='-50'>B</text><line x1='20' y1='-30' x2='20' y2='30' class='s'/><path d='M20,-20 L-20,0 L20,20' fill='white'/></g><g transform='translate(400, 340)'><text x='0' y='-50'>C</text><line x1='0' y1='-30' x2='0' y2='30' class='s'/><path d='M0,-20 L30,-20 L0,20' fill='white'/></g><g transform='translate(560, 340)'><text x='0' y='-50'>D</text><line x1='0' y1='-30' x2='0' y2='30' class='s'/><path d='M0,10 L30,25 L0,40' fill='white'/></g><g transform='translate(720, 340)'><text x='0' y='-50'>E</text><circle cx='0' cy='0' r='20' class='s'/></g></svg>",
        "explanation": "PRINSIP CERMIN VERTIKAL (KIRI-KANAN):\n1. Objek di Kiri Cermin -> Bayangan di Kanan Cermin.\n2. Bendera menghadap Kanan -> Bayangan menghadap Kiri.\n3. Tiang menjauhi cermin -> Tiang bayangan menjauhi cermin (berada di sisi terluar kanan).\nJawaban: Tiang di kanan, bendera menghadap kiri.",
        "options": [
          { "key": "A", "text": "Gambar A", "score": 0 },
          { "key": "B", "text": "Gambar B", "score": 5 },
          { "key": "C", "text": "Gambar C", "score": 0 },
          { "key": "D", "text": "Gambar D", "score": 0 },
          { "key": "E", "text": "Gambar E", "score": 0 }
        ]
      },
      {
        "id": "P4-TIU-63",
        "category": "TIU",
        "text": "Analisis Wacana Singkat:\n(1) Penduduk desa X mayoritas petani. (2) Petani desa X sedang panen raya. (3) Harga beras di pasar turun. Manakah simpulan yang mungkin?",
        "explanation": "Fakta 2 (Panen Raya) menyebabkan suplai berlebih. Hukum ekonomi: Suplai naik, harga turun (Fakta 3). Jadi hubungan yang logis adalah Panen raya menyebabkan harga turun.",
        "options": [
          { "key": "A", "text": "Semua petani desa X kaya raya.", "score": 0 },
          { "key": "B", "text": "Penduduk desa X tidak suka beras.", "score": 0 },
          { "key": "C", "text": "Panen raya petani desa X berkontribusi pada penurunan harga beras.", "score": 5 },
          { "key": "D", "text": "Harga beras turun karena impor.", "score": 0 },
          { "key": "E", "text": "Petani desa X merugi.", "score": 0 }
        ]
      },
      {
        "id": "P4-TIU-64",
        "category": "TIU",
        "text": "Figural Ketidaksamaan (Odd One Out): Manakah yang paling berbeda?",
        "svgCode": "<svg viewBox='0 0 800 450' xmlns='http://www.w3.org/2000/svg'><style>text{font-family:sans-serif;fill:white;font-size:30px;font-weight:bold;text-anchor:middle}.s{stroke:white;stroke-width:3;fill:none}.d{stroke-dasharray:5,5}</style><g transform='translate(400,100)'><text x='0' y='0' fill='#f97316' font-size='30'>CARI YANG BERBEDA!</text><text x='0' y='40' font-size='20'>(Hitung Jumlah Sisi)</text></g><line x1='0' y1='230' x2='800' y2='230' class='s d'/><g transform='translate(80, 340)'><text x='0' y='-50'>A</text><path d='M0,-25 L25,20 L-25,20 Z' class='s'/></g><g transform='translate(240, 340)'><text x='0' y='-50'>B</text><path d='M0,-25 L23,-8 L15,20 L-15,20 L-23,-8 Z' class='s'/></g><g transform='translate(400, 340)'><text x='0' y='-50'>C</text><path d='M0,-25 L18,-15 L22,5 L10,22 L-10,22 L-22,5 L-18,-15 Z' class='s'/></g><g transform='translate(560, 340)'><text x='0' y='-50'>D</text><rect x='-20' y='-20' width='40' height='40' class='s'/></g><g transform='translate(720, 340)'><text x='0' y='-50'>E</text><path d='M0,25 L-25,-20 L25,-20 Z' class='s'/></g></svg>",
        "explanation": "KAIDAH GANJIL-GENAP:\n1. Hitung jumlah sisi setiap bangun.\n2. A (3), B (5), C (7), E (3) = Semuanya GANJIL.\n3. D (4) = GENAP.\nJawaban: D adalah outlier.",
        "options": [
          { "key": "A", "text": "Gambar A", "score": 0 },
          { "key": "B", "text": "Gambar B", "score": 0 },
          { "key": "C", "text": "Gambar C", "score": 0 },
          { "key": "D", "text": "Gambar D", "score": 5 },
          { "key": "E", "text": "Gambar E", "score": 0 }
        ]
      },
      {
        "id": "P4-TIU-65",
        "category": "TIU",
        "text": "Soal Cerita (Aritmatika): Rata-rata nilai ulangan 9 siswa adalah 75. Jika nilai Andi dimasukkan, rata-ratanya menjadi 76. Berapakah nilai Andi?",
        "explanation": "Total nilai 9 siswa = 9 x 75 = 675.\nTotal nilai 10 siswa (tambah Andi) = 10 x 76 = 760.\nNilai Andi = Selisih Total = 760 - 675 = 85.",
        "options": [
          { "key": "A", "text": "80", "score": 0 },
          { "key": "B", "text": "82", "score": 0 },
          { "key": "C", "text": "84", "score": 0 },
          { "key": "D", "text": "85", "score": 5 },
          { "key": "E", "text": "90", "score": 0 }
        ]
      },
      {
        "id": "P4-TKP-66",
        "category": "TKP",
        "text": "Anda adalah staf senior. Kepala bagian baru yang usianya jauh di bawah Anda sering membuat kebijakan yang kurang praktis di lapangan karena minim pengalaman. Sikap Anda...",
        "explanation": "Aspek: Sosial Budaya & Profesionalisme. Poin 5 (Opsi D) menunjukkan keseimbangan antara hormat pada hierarki (tata krama) dan kontribusi substantif (memberi masukan). Poin 4 (Opsi C) menunjukkan loyalitas, namun pasif dalam pencegahan kesalahan organisasi.",
        "options": [
          {
            "key": "A",
            "text": "Membiarkannya melakukan kesalahan agar dia belajar dari pengalamannya sendiri secara alami.",
            "score": 2
          },
          {
            "key": "B",
            "text": "Mengkritik kebijakannya secara terbuka di dalam rapat agar semua orang tahu kelemahannya.",
            "score": 1
          },
          {
            "key": "C",
            "text": "Tetap melaksanakan perintahnya dengan patuh sebagai bentuk loyalitas bawahan kepada atasan.",
            "score": 4
          },
          {
            "key": "D",
            "text": "Menghormati wewenangnya, melaksanakan tugas, namun aktif memberikan masukan teknis secara empat mata.",
            "score": 5
          },
          {
            "key": "E",
            "text": "Membicarakan ketidakmampuannya dengan rekan kerja senior lain untuk mencari solusi bersama.",
            "score": 3
          }
        ]
      },
      {
        "id": "P4-TKP-67",
        "category": "TKP",
        "text": "Teman satu tim Anda sering datang terlambat dan pulang lebih cepat dengan berbagai alasan, sehingga beban kerja Anda bertambah. Atasan tidak menyadarinya karena teman tersebut pandai mencari muka. Sikap Anda...",
        "explanation": "Aspek: Jejaring Kerja & Komunikasi Asertif. Poin 5 (Opsi B) mengutamakan penyelesaian internal (*peer correction*) sebelum eskalasi. Poin 4 (Opsi A) efektif secara aturan, namun melewati tahap komunikasi rekan sejawat yang bisa merusak hubungan tim.",
        "options": [
          {
            "key": "A",
            "text": "Mengumpulkan bukti absensi dan kinerjanya untuk dilaporkan langsung kepada atasan agar adil.",
            "score": 4
          },
          {
            "key": "B",
            "text": "Menegurnya secara personal, mengingatkan dampak perilakunya pada tim, dan memintanya berubah.",
            "score": 5
          },
          {
            "key": "C",
            "text": "Mengerjakan bagian pekerjaannya sebisa saya agar target tim tetap tercapai dengan baik.",
            "score": 3
          },
          {
            "key": "D",
            "text": "Ikut datang terlambat dan pulang cepat agar beban kerja kembali seimbang dan adil.",
            "score": 1
          },
          {
            "key": "E",
            "text": "Menyindir perilakunya di grup percakapan kantor agar dia merasa malu dan sadar diri.",
            "score": 2
          }
        ]
      },
      {
        "id": "P4-TKP-68",
        "category": "TKP",
        "text": "Saat sedang melayani masyarakat, sistem komputer pusat mengalami gangguan massal (offline). Antrean semakin menumpuk dan warga mulai emosi. Tindakan Anda...",
        "explanation": "Aspek: TIK & Pelayanan Publik. Poin 5 (Opsi E) adalah *Service Continuity* (solusi cadangan) + *Emotional Handling*. Poin 4 (Opsi D) solutif (mencatat manual) tapi kurang dalam aspek komunikasi publik (menjelaskan situasi).",
        "options": [
          {
            "key": "A",
            "text": "Meminta warga untuk pulang dulu dan kembali lagi saat sistem sudah normal kembali.",
            "score": 1
          },
          {
            "key": "B",
            "text": "Menunggu di tempat duduk sampai teknisi memperbaiki sistem tanpa melakukan apa-apa.",
            "score": 2
          },
          {
            "key": "C",
            "text": "Menjelaskan kerusakan sistem kepada warga dan meminta mereka menunggu dengan sabar.",
            "score": 3
          },
          {
            "key": "D",
            "text": "Berinisiatif melakukan pencatatan data secara manual terlebih dahulu untuk diinput nanti.",
            "score": 4
          },
          {
            "key": "E",
            "text": "Menenangkan warga, menjelaskan situasi, dan segera melakukan pencatatan manual agar antrean terurai.",
            "score": 5
          }
        ]
      },
      {
        "id": "P4-TKP-69",
        "category": "TKP",
        "text": "Anda ditawari proyek sampingan oleh perusahaan swasta yang merupakan mitra instansi Anda. Bayarannya besar dan bisa dikerjakan di luar jam kantor, namun ada potensi benturan kepentingan. Sikap Anda...",
        "explanation": "Aspek: Integritas & Anti-Korupsi. Poin 5 (Opsi C) adalah penolakan mutlak berbasis etika (*Conflict of Interest*). Poin 4 (Opsi E) menolak, tapi alasannya teknis (waktu), bukan integritas.",
        "options": [
          {
            "key": "A",
            "text": "Menerima tawaran tersebut karena dikerjakan di luar jam dinas dan tidak mengganggu pekerjaan utama.",
            "score": 1
          },
          {
            "key": "B",
            "text": "Menerima dengan syarat nama saya tidak dicantumkan dalam struktur tim proyek tersebut.",
            "score": 2
          },
          {
            "key": "C",
            "text": "Menolak tegas karena melanggar kode etik dan berpotensi menimbulkan konflik kepentingan.",
            "score": 5
          },
          {
            "key": "D",
            "text": "Melaporkan perusahaan tersebut kepada pihak berwajib karena mencoba menyuap ASN.",
            "score": 3
          },
          {
            "key": "E",
            "text": "Menolak tawaran tersebut secara halus dengan alasan beban kerja di kantor sedang tinggi.",
            "score": 4
          }
        ]
      },
      {
        "id": "P4-TKP-70",
        "category": "TKP",
        "text": "Pemerintah mengeluarkan kebijakan baru yang kontroversial dan banyak diprotes masyarakat. Sebagai ASN, sikap Anda di media sosial adalah...",
        "explanation": "Aspek: Perekat Bangsa & Profesionalisme. Poin 5 (Opsi D) adalah peran aktif edukatif (Humas Negara). Poin 4 (Opsi C) adalah netralitas pasif (aman, tapi kurang kontributif).",
        "options": [
          {
            "key": "A",
            "text": "Ikut menyuarakan kritik terhadap kebijakan tersebut agar terlihat pro-rakyat di mata teman-teman.",
            "score": 1
          },
          {
            "key": "B",
            "text": "Membela kebijakan pemerintah secara agresif di kolom komentar terhadap siapapun yang mengkritik.",
            "score": 2
          },
          {
            "key": "C",
            "text": "Memilih untuk tidak berkomentar apa pun dan bersikap netral di media sosial pribadi.",
            "score": 4
          },
          {
            "key": "D",
            "text": "Memberikan penjelasan edukatif mengenai dasar kebijakan tersebut secara santun dan berbasis data.",
            "score": 5
          },
          {
            "key": "E",
            "text": "Hanya membagikan postingan resmi instansi tanpa menambahkan opini pribadi apapun.",
            "score": 3
          }
        ]
      },
      {
        "id": "P4-TKP-71",
        "category": "TKP",
        "text": "Anda ditugaskan dalam tim lintas divisi untuk sebuah proyek nasional. Salah satu anggota tim dari divisi lain sangat dominan, kaku, dan sering menolak ide orang lain tanpa alasan jelas. Hal ini membuat anggota lain pasif. Sikap Anda...",
        "explanation": "Aspek: Jejaring Kerja. Poin 5 (Opsi E) pendekatan *Interpersonal Influence* (merangkul). Poin 4 (Opsi A) pendekatan prosedural (lapor ketua), benar tapi kurang inisiatif kepemimpinan.",
        "options": [
          {
            "key": "A",
            "text": "Melaporkan perilaku dominan tersebut kepada ketua tim agar diberikan teguran atau arahan.",
            "score": 4
          },
          {
            "key": "B",
            "text": "Mendebatnya secara terbuka di forum rapat agar dia menyadari kekeliruan sikapnya.",
            "score": 2
          },
          {
            "key": "C",
            "text": "Diam saja dan mengikuti kemauannya agar proyek cepat selesai tanpa konflik berkepanjangan.",
            "score": 1
          },
          {
            "key": "D",
            "text": "Mengajak anggota lain untuk tetap menyuarakan pendapat meskipun sering ditolak.",
            "score": 3
          },
          {
            "key": "E",
            "text": "Melakukan pendekatan personal untuk memahami perspektifnya, lalu mengajaknya berdiskusi secara terbuka.",
            "score": 5
          }
        ]
      },
      {
        "id": "P4-TKP-72",
        "category": "TKP",
        "text": "Di lingkungan tempat tinggal Anda, ada sekelompok pendatang baru yang sangat tertutup. Mereka menolak bergaul, tidak memasang bendera saat 17 Agustus, dan sering mengadakan pertemuan tertutup larut malam. Sikap Anda...",
        "explanation": "Aspek: Anti-Radikalisme & Kewaspadaan. Poin 5 (Opsi D) Prosedur deteksi dini yang benar (Lapor aparat setempat). Poin 4 (Opsi C) Waspada (Observasi) tapi belum ada tindakan konkret pelaporan.",
        "options": [
          {
            "key": "A",
            "text": "Mengajak warga lain untuk mengusir mereka karena dianggap meresahkan lingkungan.",
            "score": 1
          },
          {
            "key": "B",
            "text": "Masa bodoh dengan urusan mereka selama tidak mengganggu ketenangan saya secara langsung.",
            "score": 2
          },
          {
            "key": "C",
            "text": "Meningkatkan kewaspadaan dan mengamati gerak-gerik mereka secara diam-diam.",
            "score": 4
          },
          {
            "key": "D",
            "text": "Melaporkan kejanggalan tersebut kepada Ketua RT dan Babinsa agar dilakukan pendekatan resmi.",
            "score": 5
          },
          {
            "key": "E",
            "text": "Mencoba menegur mereka secara langsung agar mau bersosialisasi dengan warga.",
            "score": 3
          }
        ]
      },
      {
        "id": "P4-TKP-73",
        "category": "TKP",
        "text": "Anda sedang mengerjakan tugas kantor yang sangat menumpuk dan deadline besok pagi. Tiba-tiba, pasangan Anda menelepon meminta dijemput karena kendaraannya mogok di tempat yang jauh. Sikap Anda...",
        "explanation": "Aspek: Profesionalisme & Problem Solving. Poin 5 (Opsi E) *Win-Win Solution* (Kerja tuntas, keluarga aman). Poin 4 (Opsi D) Mirip E, tapi opsi E lebih menekankan 'pemantauan hingga aman' (empati lebih tinggi).",
        "options": [
          {
            "key": "A",
            "text": "Meminta pasangan saya pulang sendiri naik taksi online karena saya sangat sibuk mengejar deadline.",
            "score": 2
          },
          {
            "key": "B",
            "text": "Segera meninggalkan kantor untuk menjemputnya, tugas kantor bisa dilanjutkan nanti malam.",
            "score": 1
          },
          {
            "key": "C",
            "text": "Meminta izin atasan untuk pulang lebih cepat dengan alasan urusan keluarga mendesak.",
            "score": 3
          },
          {
            "key": "D",
            "text": "Memesankan transportasi online untuknya agar bisa pulang, lalu saya lanjut bekerja.",
            "score": 4
          },
          {
            "key": "E",
            "text": "Memesankan bantuan transportasi/bengkel, memantau kondisinya hingga aman, sambil tetap menuntaskan tugas.",
            "score": 5
          }
        ]
      },
      {
        "id": "P4-TKP-74",
        "category": "TKP",
        "text": "Rekan kerja Anda sering menggunakan kendaraan dinas kantor untuk keperluan pribadi di akhir pekan, bahkan untuk jalan-jalan ke luar kota. Anda tahu hal ini melanggar aturan penggunaan aset negara. Sikap Anda...",
        "explanation": "Aspek: Integritas & Kontrol Sosial. Poin 5 (Opsi C) Berani mengingatkan (tahap 1 pencegahan). Poin 4 (Opsi D) Melapor (tahap 2 penindakan). Dalam etika kerja, mengingatkan rekan terlebih dahulu dianggap lebih bijak sebelum eskalasi, kecuali pelanggaran berat pidana.",
        "options": [
          {
            "key": "A",
            "text": "Ikut meminjam kendaraan dinas juga jika sedang membutuhkannya karena banyak yang melakukannya.",
            "score": 1
          },
          {
            "key": "B",
            "text": "Diam saja dan tidak mau ikut campur karena takut merusak hubungan pertemanan di kantor.",
            "score": 2
          },
          {
            "key": "C",
            "text": "Mengingatkannya secara personal bahwa hal tersebut melanggar aturan dan berisiko bagi karirnya.",
            "score": 5
          },
          {
            "key": "D",
            "text": "Melaporkan penyalahgunaan aset tersebut langsung ke bagian umum atau pengawas internal.",
            "score": 4
          },
          {
            "key": "E",
            "text": "Menyindir perilakunya saat sedang makan siang bersama rekan-rekan lain.",
            "score": 3
          }
        ]
      },
      {
        "id": "P4-TKP-75",
        "category": "TKP",
        "text": "Dalam sebuah diskusi di media sosial, Anda menemukan narasi yang viral namun menyesatkan (hoaks) yang menyudutkan pemerintah seolah-olah anti-agama tertentu. Narasi ini berpotensi memicu kerusuhan. Sikap Anda...",
        "explanation": "Aspek: Anti-Radikalisme & Literasi Digital. Poin 5 (Opsi D) Aksi aktif mengklarifikasi (Edukasi). Poin 4 (Opsi A) Aksi lapor (Preventif/Represif), skor 4 karena tidak ada unsur edukasi publik.",
        "options": [
          {
            "key": "A",
            "text": "Segera melaporkan akun tersebut melalui fitur 'report' agar postingan dihapus oleh platform.",
            "score": 4
          },
          {
            "key": "B",
            "text": "Mengabaikannya dan tidak ikut berkomentar karena tidak ingin terlibat debat kusir.",
            "score": 2
          },
          {
            "key": "C",
            "text": "Membagikan narasi tersebut ke grup keluarga untuk menanyakan kebenarannya.",
            "score": 1
          },
          {
            "key": "D",
            "text": "Mencari data valid, lalu memberikan klarifikasi santun di kolom komentar sebagai penyeimbang informasi.",
            "score": 5
          },
          {
            "key": "E",
            "text": "Membalas dengan komentar pedas kepada penyebar hoaks agar dia jera.",
            "score": 3
          }
        ]
      },
      {
        "id": "P4-TKP-76",
        "category": "TKP",
        "text": "Anda baru saja dipromosikan menjadi pimpinan cabang di daerah baru. Karyawan di sana terbiasa bekerja santai dan 'asal bapak senang'. Target perusahaan sering tidak tercapai. Langkah awal Anda...",
        "explanation": "Aspek: Kemampuan Menggerakkan & Adaptasi. Poin 5 (Opsi B) *Diagnostic Reading* (Observasi -> Strategi). Poin 4 (Opsi E) *Monitoring* (Kontrol), baik tapi belum menyentuh akar masalah budaya.",
        "options": [
          {
            "key": "A",
            "text": "Langsung menerapkan aturan disiplin ketat dan sanksi tegas bagi yang masih malas.",
            "score": 2
          },
          {
            "key": "B",
            "text": "Mengobservasi budaya kerja, berdialog untuk memahami kendala, lalu menyusun target baru bersama.",
            "score": 5
          },
          {
            "key": "C",
            "text": "Meminta pergantian karyawan dengan membawa tim kepercayaan saya dari pusat.",
            "score": 1
          },
          {
            "key": "D",
            "text": "Menjanjikan bonus besar di awal agar mereka termotivasi bekerja lebih giat.",
            "score": 3
          },
          {
            "key": "E",
            "text": "Mengadakan rapat rutin setiap pagi dan sore untuk memantau kinerja harian secara ketat.",
            "score": 4
          }
        ]
      },
      {
        "id": "P4-TKP-77",
        "category": "TKP",
        "text": "Anda memiliki rekan kerja yang sangat kompeten secara teknis, namun sering menolak jika diajak bekerjasama dengan rekan yang berbeda latar belakang agama atau suku. Sikap Anda...",
        "explanation": "Aspek: Moderasi Beragama. Poin 5 (Opsi E) Upaya inklusif persuasif. Poin 4 (Opsi C) Upaya administratif (lapor). Membiarkan (A/B) adalah nilai terendah.",
        "options": [
          {
            "key": "A",
            "text": "Menghormati pilihannya untuk bekerja sendiri karena itu hak asasi pribadinya.",
            "score": 1
          },
          {
            "key": "B",
            "text": "Membiarkannya bekerja sendiri asalkan target pekerjaan tim tetap tercapai.",
            "score": 2
          },
          {
            "key": "C",
            "text": "Melaporkan sikap eksklusifnya ke atasan karena berpotensi merusak harmoni tim.",
            "score": 4
          },
          {
            "key": "D",
            "text": "Menyindir sikapnya di depan orang banyak agar dia sadar bahwa perilakunya salah.",
            "score": 3
          },
          {
            "key": "E",
            "text": "Mengajaknya diskusi personal tentang pentingnya kolaborasi, dan melibatkannya dalam proyek majemuk.",
            "score": 5
          }
        ]
      },
      {
        "id": "P4-TKP-78",
        "category": "TKP",
        "text": "Instansi Anda akan mengadakan kerjasama dengan pihak swasta asing. Anda mengetahui bahwa perusahaan tersebut memiliki rekam jejak pencemaran lingkungan yang buruk di negara lain, namun tawaran investasinya sangat menguntungkan. Sikap Anda sebagai analis...",
        "explanation": "Aspek: Profesionalisme & Pengambilan Keputusan. Poin 5 (Opsi D) Analisis risiko komprehensif. Poin 4 (Opsi C) Menolak (Prinsip benar, tapi sebagai analis harus menyajikan data, bukan sekadar menolak).",
        "options": [
          {
            "key": "A",
            "text": "Menyarankan pimpinan menerima karena keuntungan ekonomi adalah prioritas saat ini.",
            "score": 1
          },
          {
            "key": "B",
            "text": "Diam saja dan menyerahkan keputusan sepenuhnya kepada pimpinan instansi.",
            "score": 2
          },
          {
            "key": "C",
            "text": "Menyarankan pimpinan untuk langsung menolak kerjasama tersebut demi lingkungan.",
            "score": 4
          },
          {
            "key": "D",
            "text": "Membuat kajian risiko lingkungan dan reputasi, lalu merekomendasikan pertimbangan ulang dengan syarat ketat.",
            "score": 5
          },
          {
            "key": "E",
            "text": "Membocorkan informasi tersebut ke media agar kerjasama dibatalkan oleh tekanan publik.",
            "score": 3
          }
        ]
      },
      {
        "id": "P4-TKP-79",
        "category": "TKP",
        "text": "Anda sedang mengikuti diklat kepemimpinan. Panitia membagi kelompok secara acak. Anda satu kelompok dengan peserta yang terkenal lambat kinerjanya dan sulit diajak komunikasi. Besok harus presentasi tugas besar. Strategi Anda...",
        "explanation": "Aspek: Manajemen Tim. Poin 5 (Opsi C) *Empowerment* (Pemberdayaan). Poin 4 (Opsi D) *Pushing* (Memotivasi/Mendesak). Mengerjakan sendiri (A) adalah kegagalan manajerial.",
        "options": [
          {
            "key": "A",
            "text": "Mengerjakan sebagian besar tugas sendirian untuk memastikan hasilnya sempurna.",
            "score": 3
          },
          {
            "key": "B",
            "text": "Meminta panitia untuk memindahkan saya ke kelompok lain yang lebih kompeten.",
            "score": 1
          },
          {
            "key": "C",
            "text": "Membagi tugas sesuai kemampuan, memberikan instruksi jelas, dan melakukan pengecekan berkala padanya.",
            "score": 5
          },
          {
            "key": "D",
            "text": "Terus mendorong dan mendesaknya agar bisa bekerja lebih cepat mengimbangi kelompok.",
            "score": 4
          },
          {
            "key": "E",
            "text": "Pasrah dengan kondisi kelompok dan mengerjakan tugas seadanya.",
            "score": 2
          }
        ]
      },
      {
        "id": "P4-TKP-80",
        "category": "TKP",
        "text": "Seorang teman akrab mengajak Anda bergabung dalam grup pengajian eksklusif yang mengajarkan bahwa hormat kepada bendera merah putih adalah perbuatan syirik (menyekutukan Tuhan). Respon Anda...",
        "explanation": "Aspek: Anti-Radikalisme. Poin 5 (Opsi E) Penolakan tegas + Kontra narasi kebangsaan. Poin 4 (Opsi C) Menghindar (Aman, tapi tidak ada upaya meluruskan).",
        "options": [
          {
            "key": "A",
            "text": "Ikut hadir sekali saja untuk menghormati ajakan teman, lalu keluar.",
            "score": 1
          },
          {
            "key": "B",
            "text": "Menolak secara halus dengan alasan kesibukan pekerjaan agar tidak menyinggung.",
            "score": 2
          },
          {
            "key": "C",
            "text": "Diam saja, mengalihkan pembicaraan, dan perlahan menjauhi teman tersebut.",
            "score": 4
          },
          {
            "key": "D",
            "text": "Melaporkan teman tersebut ke polisi saat itu juga tanpa peringatan.",
            "score": 3
          },
          {
            "key": "E",
            "text": "Menolak tegas dan menjelaskan bahwa hormat bendera adalah wujud cinta tanah air, bukan penyembahan.",
            "score": 5
          }
        ]
      },
      {
        "id": "P4-TKP-81",
        "category": "TKP",
        "text": "Instansi Anda baru saja migrasi ke sistem *cloud* penuh. Banyak pegawai senior yang menolak menggunakan sistem baru dan kembali menggunakan kertas karena takut salah input. Hal ini membuat data tidak sinkron. Sikap Anda sebagai agen perubahan...",
        "explanation": "Aspek: TIK & Kemampuan Menggerakkan. Poin 5 (Opsi E) Pendekatan persuasif + Mentoring. Poin 4 (Opsi D) Pendekatan teknis (Manual book).",
        "options": [
          {
            "key": "A",
            "text": "Mendesak pimpinan untuk memberikan sanksi tegas bagi pegawai yang menolak sistem baru.",
            "score": 2
          },
          {
            "key": "B",
            "text": "Membantu menginputkan data mereka ke sistem agar pekerjaan divisi tetap beres.",
            "score": 3
          },
          {
            "key": "C",
            "text": "Melaporkan ketidakpatuhan tersebut ke bagian IT agar akun mereka dicek.",
            "score": 1
          },
          {
            "key": "D",
            "text": "Membuat panduan tertulis (*manual book*) langkah demi langkah yang ditempel di setiap meja.",
            "score": 4
          },
          {
            "key": "E",
            "text": "Melakukan pendekatan personal, mendemonstrasikan kemudahan sistem, dan menawarkan diri menjadi mentor.",
            "score": 5
          }
        ]
      },
      {
        "id": "P4-TKP-82",
        "category": "TKP",
        "text": "Anda ditempatkan di bagian arsip yang sangat berdebu dan berantakan. Anggaran untuk perbaikan dan digitalisasi baru turun tahun depan. Padahal, pencarian dokumen sering memakan waktu lama. Inovasi Anda...",
        "explanation": "Aspek: Kreativitas. Poin 5 (Opsi D) Inovasi sistemik tanpa biaya (*Low cost high impact*). Poin 4 (Opsi E) Kebersihan (Bagus, tapi tidak menyelesaikan masalah pencarian data).",
        "options": [
          {
            "key": "A",
            "text": "Bekerja seperti biasa seadanya sambil menunggu anggaran turun tahun depan.",
            "score": 1
          },
          {
            "key": "B",
            "text": "Mengeluh kepada atasan tentang kondisi ruangan yang tidak sehat dan tidak efisien.",
            "score": 2
          },
          {
            "key": "C",
            "text": "Membeli alat scanner dengan uang pribadi untuk mulai menyicil digitalisasi.",
            "score": 3
          },
          {
            "key": "D",
            "text": "Menata ulang arsip fisik dengan kode warna dan membuat database indeks lokasi di Excel.",
            "score": 5
          },
          {
            "key": "E",
            "text": "Mengajak staf lain gotong royong membersihkan ruangan setiap pagi agar lebih nyaman.",
            "score": 4
          }
        ]
      },
      {
        "id": "P4-TKP-83",
        "category": "TKP",
        "text": "Anda sedang dinas luar kota dan harus mengirimkan laporan rahasia negara yang sangat mendesak. Koneksi internet di hotel sangat lambat, namun ada Wi-Fi publik gratis di kafe sebelah yang kencang. Sikap Anda...",
        "explanation": "Aspek: TIK (Keamanan Informasi). Poin 5 (Opsi C) *Security Awareness* (Jaringan aman > Kecepatan). Poin 4 (Opsi E) Aman tapi menunda pekerjaan. Menggunakan Wifi Publik (A/B) untuk data rahasia adalah pelanggaran fatal.",
        "options": [
          {
            "key": "A",
            "text": "Menggunakan Wi-Fi kafe demi mengejar deadline yang sangat mendesak.",
            "score": 1
          },
          {
            "key": "B",
            "text": "Menggunakan Wi-Fi kafe tetapi segera mengganti password email setelah mengirim file.",
            "score": 2
          },
          {
            "key": "C",
            "text": "Tetap menggunakan koneksi hotel atau tethering seluler pribadi yang aman, dan mengabari atasan jika ada keterlambatan.",
            "score": 5
          },
          {
            "key": "D",
            "text": "Meminta resepsionis hotel untuk memperbaiki internet secepatnya.",
            "score": 3
          },
          {
            "key": "E",
            "text": "Menunda pengiriman laporan sampai mendapatkan koneksi yang benar-benar aman.",
            "score": 4
          }
        ]
      },
      {
        "id": "P4-TKP-84",
        "category": "TKP",
        "text": "Pemerintah mendadak mengubah regulasi impor yang berdampak besar pada prosedur kerja divisi Anda. Klien-klien mulai panik dan membanjiri kantor dengan komplain. Suasana menjadi *chaos*. Respon Anda...",
        "explanation": "Aspek: Kemampuan Adaptasi & Pengendalian Diri. Poin 5 (Opsi E) Tenang + Strategis (Pahami -> Briefing -> Sosialisasi). Poin 4 (Opsi D) Tenang + Taktis (Langsung kerja), tapi kurang strategis dalam manajemen kepanikan massal.",
        "options": [
          {
            "key": "A",
            "text": "Ikut panik dan menyalahkan pemerintah pusat yang mengubah aturan secara mendadak.",
            "score": 1
          },
          {
            "key": "B",
            "text": "Meminta klien untuk tenang dan menunggu instruksi lebih lanjut tanpa memberikan kepastian.",
            "score": 3
          },
          {
            "key": "C",
            "text": "Menutup loket pelayanan sementara sampai situasi kembali kondusif.",
            "score": 2
          },
          {
            "key": "D",
            "text": "Mempelajari aturan baru secepatnya dan melayani klien satu per satu sesuai aturan baru.",
            "score": 4
          },
          {
            "key": "E",
            "text": "Mempelajari poin perubahan, memberikan briefing singkat ke tim, lalu mensosialisasikan ke klien untuk meredam panik.",
            "score": 5
          }
        ]
      },
      {
        "id": "P4-TKP-85",
        "category": "TKP",
        "text": "Anda memiliki latar belakang pendidikan Teknik Sipil, namun karena kebutuhan organisasi, Anda dimutasi ke bagian Hubungan Masyarakat (Humas) yang menuntut kemampuan komunikasi publik. Sikap Anda...",
        "explanation": "Aspek: Kemampuan Belajar (*Learning Agility*). Poin 5 (Opsi B) *Growth Mindset*. Poin 4 (Opsi E) Proaktif tapi bergantung (minta pelatihan).",
        "options": [
          {
            "key": "A",
            "text": "Mengajukan keberatan kepada bagian kepegawaian karena tidak sesuai dengan kompetensi ijazah.",
            "score": 1
          },
          {
            "key": "B",
            "text": "Menerima sebagai tantangan belajar, segera mempelajari ilmu komunikasi, dan beradaptasi.",
            "score": 5
          },
          {
            "key": "C",
            "text": "Menerima saja perintah atasan sebagai bentuk loyalitas pegawai.",
            "score": 3
          },
          {
            "key": "D",
            "text": "Bekerja sebisanya di bagian Humas sambil mencari peluang untuk kembali ke divisi teknis.",
            "score": 2
          },
          {
            "key": "E",
            "text": "Meminta dikirimkan ke pelatihan kehumasan terlebih dahulu sebelum mulai bekerja efektif.",
            "score": 4
          }
        ]
      },
      {
        "id": "P4-TKP-86",
        "category": "TKP",
        "text": "Penggunaan *Artificial Intelligence* (AI) mulai diterapkan di kantor untuk tugas administratif. Anda khawatir AI akan menggantikan peran Anda dan rekan-rekan. Sikap terbaik adalah...",
        "explanation": "Aspek: TIK & Adaptasi. Poin 5 (Opsi D) Kolaborasi dengan teknologi (*Smart ASN*). Poin 4 (Opsi A) Kompetisi dengan teknologi (Mindset yang kurang tepat, karena AI adalah alat bantu).",
        "options": [
          {
            "key": "A",
            "text": "Mempelajari cara kerja AI secara mendalam agar bisa bekerja lebih baik daripada mesin.",
            "score": 4
          },
          {
            "key": "B",
            "text": "Menolak penggunaan AI dan meyakinkan atasan bahwa pekerjaan manusia lebih berkualitas.",
            "score": 1
          },
          {
            "key": "C",
            "text": "Pasrah jika memang suatu saat posisi saya harus tergantikan oleh teknologi.",
            "score": 2
          },
          {
            "key": "D",
            "text": "Meningkatkan kemampuan soft-skill yang tidak dimiliki AI dan memanfaatkan AI untuk efisiensi kerja.",
            "score": 5
          },
          {
            "key": "E",
            "text": "Hanya menggunakan AI jika diperintahkan langsung oleh atasan.",
            "score": 3
          }
        ]
      },
      {
        "id": "P4-TKP-87",
        "category": "TKP",
        "text": "Anggaran dinas dipotong 50% tahun ini, namun target kinerja dinaikkan 20%. Tim Anda merasa ini mustahil dan motivasi menurun drastis. Sebagai ketua tim, strategi Anda...",
        "explanation": "Aspek: Kreativitas & Orientasi Hasil. Poin 5 (Opsi E) *Creative Problem Solving*. Poin 4 (Opsi B) Negosiasi (Realistis, tapi kalah poin dengan inovasi).",
        "options": [
          {
            "key": "A",
            "text": "Mengajukan protes keras ke bagian keuangan dan perencanaan atas ketidakadilan target.",
            "score": 2
          },
          {
            "key": "B",
            "text": "Mencoba bernegosiasi dengan pimpinan untuk meminta keringanan atau penyesuaian target.",
            "score": 4
          },
          {
            "key": "C",
            "text": "Meminta tim bekerja lembur ekstra keras meskipun tanpa anggaran uang lembur.",
            "score": 1
          },
          {
            "key": "D",
            "text": "Mengurangi kualitas kegiatan agar bisa cukup dengan anggaran yang ada.",
            "score": 3
          },
          {
            "key": "E",
            "text": "Mengajak tim mencari metode kerja baru yang lebih efisien dan murah (inovasi) untuk mencapai target.",
            "score": 5
          }
        ]
      },
      {
        "id": "P4-TKP-88",
        "category": "TKP",
        "text": "Anda menerima email yang terlihat resmi dari 'Admin IT Pusat' meminta Anda mengklik tautan untuk memverifikasi password akun kepegawaian Anda. Email tersebut masuk di jam kerja sibuk. Tindakan Anda...",
        "explanation": "Aspek: TIK (Keamanan). Poin 5 (Opsi C) Prinsip *Zero Trust* (Verifikasi). Poin 4 (Opsi E) Tindakan pelaporan (Benar, tapi verifikasi adalah langkah logis pertama sebelum melabeli spam).",
        "options": [
          {
            "key": "A",
            "text": "Langsung mengklik tautan tersebut agar akun kepegawaian saya tidak terblokir.",
            "score": 1
          },
          {
            "key": "B",
            "text": "Mengabaikan email tersebut begitu saja karena sibuk bekerja.",
            "score": 2
          },
          {
            "key": "C",
            "text": "Mengecek alamat pengirim dengan teliti dan mengonfirmasi ke tim IT melalui saluran resmi.",
            "score": 5
          },
          {
            "key": "D",
            "text": "Membalas email tersebut untuk bertanya apakah permintaan ini benar.",
            "score": 3
          },
          {
            "key": "E",
            "text": "Menandai email tersebut sebagai spam dan menghapusnya.",
            "score": 4
          }
        ]
      },
      {
        "id": "P4-TKP-89",
        "category": "TKP",
        "text": "Atasan Anda adalah tipe pemimpin mikromanajemen yang selalu menuntut laporan detail setiap jam, padahal Anda sedang mengerjakan proyek kreatif yang butuh fokus. Hal ini menghambat produktivitas. Sikap Anda...",
        "explanation": "Aspek: Komunikasi. Poin 5 (Opsi D) Negosiasi solusi (*Win-Win*). Poin 4 (Opsi C) Patuh (Profesional, tapi produktivitas terganggu).",
        "options": [
          {
            "key": "A",
            "text": "Mengabaikan permintaan laporannya dan fokus menyelesaikan pekerjaan.",
            "score": 2
          },
          {
            "key": "B",
            "text": "Mengeluh kepada rekan kerja lain tentang gaya kepemimpinan atasan.",
            "score": 1
          },
          {
            "key": "C",
            "text": "Menuruti saja semua permintaannya meskipun pekerjaan utama jadi terhambat.",
            "score": 4
          },
          {
            "key": "D",
            "text": "Mengajukan usulan format laporan rekapitulasi harian agar saya bisa lebih fokus bekerja.",
            "score": 5
          },
          {
            "key": "E",
            "text": "Mengerjakan laporan asal-asalan agar cepat selesai.",
            "score": 3
          }
        ]
      },
      {
        "id": "P4-TKP-90",
        "category": "TKP",
        "text": "Di tengah presentasi penting di depan investor, proyektor tiba-tiba mati total dan teknisi sedang tidak ada. File presentasi ada di laptop Anda. Respon Anda...",
        "explanation": "Aspek: Pengendalian Diri & Kreativitas. Poin 5 (Opsi B) *Plan B* (Improvisasi). Poin 4 (Opsi D) Usaha memperbaiki (Baik, tapi berisiko terlihat tidak siap/membuang waktu).",
        "options": [
          {
            "key": "A",
            "text": "Meminta maaf berkali-kali dan terlihat panik mencari bantuan orang lain.",
            "score": 2
          },
          {
            "key": "B",
            "text": "Tetap tenang, membagikan materi *softcopy* ke gawai investor, dan lanjut presentasi secara lisan.",
            "score": 5
          },
          {
            "key": "C",
            "text": "Menunda presentasi sampai proyektor berhasil diperbaiki oleh teknisi.",
            "score": 3
          },
          {
            "key": "D",
            "text": "Mencoba mengotak-atik proyektor sendiri untuk memperbaikinya.",
            "score": 4
          },
          {
            "key": "E",
            "text": "Menyalahkan staf perlengkapan yang tidak mengecek alat sebelum acara.",
            "score": 1
          }
        ]
      },
      {
        "id": "P4-TKP-91",
        "category": "TKP",
        "text": "Kantor menerapkan kebijakan *Work From Home* (WFH). Anda merasa sulit fokus di rumah karena gangguan anak-anak dan pekerjaan rumah tangga. Performa Anda mulai turun. Solusi Anda...",
        "explanation": "Aspek: Manajemen Diri. Poin 5 (Opsi E) Adaptasi lingkungan (Solusi mandiri). Poin 4 (Opsi A) Kembali ke kantor (Solusi, tapi berarti gagal adaptasi WFH).",
        "options": [
          {
            "key": "A",
            "text": "Meminta izin atasan untuk tetap bekerja di kantor saja setiap hari.",
            "score": 4
          },
          {
            "key": "B",
            "text": "Meminta keringanan beban kerja selama masa WFH karena situasi rumah.",
            "score": 2
          },
          {
            "key": "C",
            "text": "Bekerja di malam hari saat anak-anak tidur, meskipun jam tidur saya berkurang.",
            "score": 3
          },
          {
            "key": "D",
            "text": "Sering telat merespon pesan kantor dengan alasan sedang mengurus anak.",
            "score": 1
          },
          {
            "key": "E",
            "text": "Menata ruang kerja khusus, membuat jadwal tegas dengan keluarga, dan disiplin waktu.",
            "score": 5
          }
        ]
      },
      {
        "id": "P4-TKP-92",
        "category": "TKP",
        "text": "Anda melihat peluang untuk mempromosikan potensi pariwisata daerah tempat Anda bertugas melalui TikTok/Instagram Reels, namun pimpinan Anda menganggap media sosial itu 'mainan anak kecil' dan tidak berwibawa. Sikap Anda...",
        "explanation": "Aspek: Kreativitas & Komunikasi. Poin 5 (Opsi D) Bukti Nyata (*Evidence Based*). Poin 4 (Opsi A) Membuat proposal (Formal, tapi seringkali kalah kuat dibanding bukti visual).",
        "options": [
          {
            "key": "A",
            "text": "Mengajukan proposal tertulis yang menjelaskan teori manfaat media sosial.",
            "score": 4
          },
          {
            "key": "B",
            "text": "Membatalkan ide tersebut karena tidak mendapat dukungan pimpinan.",
            "score": 2
          },
          {
            "key": "C",
            "text": "Mengkritik pemikiran pimpinan yang dianggap kuno kepada rekan kerja.",
            "score": 1
          },
          {
            "key": "D",
            "text": "Membuat satu konten contoh berkualitas (*pilot project*), tunjukkan datanya, lalu presentasikan ulang.",
            "score": 5
          },
          {
            "key": "E",
            "text": "Membuat konten diam-diam di akun pribadi tanpa membawa nama instansi.",
            "score": 3
          }
        ]
      },
      {
        "id": "P4-TKP-93",
        "category": "TKP",
        "text": "Saat melayani publik, seorang warga tunanetra datang untuk mengurus dokumen. Tidak ada fasilitas huruf Braille atau jalur khusus di kantor Anda. Sikap Anda...",
        "explanation": "Aspek: Pelayanan Publik. Poin 5 (Opsi C) Pelayanan Prima (*Extra Mile*). Poin 4 (Opsi E) Cepat (Efisien, tapi empati kurang dibanding C).",
        "options": [
          {
            "key": "A",
            "text": "Meminta bantuan satpam untuk menguruskan keperluan warga tersebut.",
            "score": 3
          },
          {
            "key": "B",
            "text": "Melayaninya di loket seperti warga biasa agar tidak ada diskriminasi.",
            "score": 2
          },
          {
            "key": "C",
            "text": "Segera menghampiri, mendampingi proses pengisian formulir secara penuh, dan memprioritaskannya.",
            "score": 5
          },
          {
            "key": "D",
            "text": "Menyarankan dia datang bersama pendamping keluarga di lain kesempatan.",
            "score": 1
          },
          {
            "key": "E",
            "text": "Melayaninya sesegera mungkin agar antrean di belakangnya tidak terhambat.",
            "score": 4
          }
        ]
      },
      {
        "id": "P4-TKP-94",
        "category": "TKP",
        "text": "Anda ditugaskan memimpin rapat evaluasi bulanan secara daring (Zoom). Di tengah rapat, beberapa peserta lupa mematikan mikrofon (*unmute*) sehingga suara bising masuk dan mengganggu. Anda sudah menegur tapi mereka tidak sadar. Tindakan Anda...",
        "explanation": "Aspek: TIK & Kepemimpinan. Poin 5 (Opsi D) Kontrol teknis tegas. Poin 4 (Opsi A) Menunggu (Sabar, tapi rapat jadi tidak efektif).",
        "options": [
          {
            "key": "A",
            "text": "Diam sejenak menunggu sampai peserta tersebut sadar dan mematikan mikrofonnya.",
            "score": 4
          },
          {
            "key": "B",
            "text": "Marah dan membentak peserta agar diam karena mengganggu jalannya rapat.",
            "score": 2
          },
          {
            "key": "C",
            "text": "Menghentikan rapat dan menundanya sampai situasi kondusif.",
            "score": 3
          },
          {
            "key": "D",
            "text": "Langsung mematikan mikrofon peserta (*Mute All*) selaku Host, lalu melanjutkan rapat.",
            "score": 5
          },
          {
            "key": "E",
            "text": "Mengeluarkan peserta tersebut dari ruang rapat (*Kick*) sebagai peringatan.",
            "score": 1
          }
        ]
      },
      {
        "id": "P4-TKP-95",
        "category": "TKP",
        "text": "Sistem kerja baru menuntut Anda berkolaborasi dengan divisi lain yang selama ini menjadi 'rival' atau pesaing divisi Anda dalam perlombaan kinerja kantor. Suasana awal sangat kaku dan penuh curiga. Inisiatif Anda...",
        "explanation": "Aspek: Jejaring Kerja. Poin 5 (Opsi E) Membangun hubungan (*Ice breaking*). Poin 4 (Opsi B) Profesional murni (Bagus, tapi kaku).",
        "options": [
          {
            "key": "A",
            "text": "Tetap waspada dan membatasi pembagian informasi penting kepada mereka.",
            "score": 1
          },
          {
            "key": "B",
            "text": "Bekerja secara profesional sesuai porsi masing-masing tanpa perlu terlalu akrab.",
            "score": 4
          },
          {
            "key": "C",
            "text": "Mengikuti arus saja bagaimana jalannya kerjasama tersebut nanti.",
            "score": 2
          },
          {
            "key": "D",
            "text": "Berusaha menunjukkan bahwa divisi saya lebih kompeten daripada divisi mereka.",
            "score": 3
          },
          {
            "key": "E",
            "text": "Mengajak sesi santai atau makan bersama untuk mencairkan suasana dan menyamakan visi.",
            "score": 5
          }
        ]
      },
      {
        "id": "P4-TKP-96",
        "category": "TKP",
        "text": "Anda adalah ketua panitia pengadaan barang jasa. Adik kandung Anda yang sedang kesulitan ekonomi memohon agar perusahaannya dibocorkan sedikit saja spesifikasi teknis agar bisa menang tender. Dia menangis dan mengatakan ini menyangkut nasib keponakan Anda yang sakit. Sikap Anda...",
        "explanation": "Aspek: Integritas. Poin 5 (Opsi D) Menolak Korupsi + Solusi Pribadi (Empati). Poin 4 (Opsi C) Menolak Korupsi (Tegas, tapi tanpa solusi empati untuk keluarga).",
        "options": [
          {
            "key": "A",
            "text": "Memberikan sedikit bocoran informasi umum yang dirasa tidak terlalu krusial.",
            "score": 1
          },
          {
            "key": "B",
            "text": "Menyarankannya ikut tender normal, namun berjanji membantunya saat tahap evaluasi.",
            "score": 2
          },
          {
            "key": "C",
            "text": "Menolak dengan tegas permintaan tersebut dan memutus komunikasi sementara waktu.",
            "score": 4
          },
          {
            "key": "D",
            "text": "Menolak membocorkan rahasia jabatan, namun menawarkan bantuan uang pribadi untuk pengobatan keponakan.",
            "score": 5
          },
          {
            "key": "E",
            "text": "Meminta rekan panitia lain untuk membantu adik saya agar saya tidak terlibat langsung.",
            "score": 3
          }
        ]
      },
      {
        "id": "P4-TKP-97",
        "category": "TKP",
        "text": "Dua atasan Anda (Direktur A dan Direktur B) sedang terlibat konflik terbuka dan saling menjatuhkan di depan staf. Anda berada di tengah-tengah dan dipaksa untuk memihak salah satu kubu. Sikap Anda...",
        "explanation": "Aspek: Profesionalisme. Poin 5 (Opsi C) Netralitas Aktif (Fokus kerja). Poin 4 (Opsi E) Mediasi (Baik, tapi berisiko tinggi bagi bawahan untuk menengahi atasan yang sedang panas).",
        "options": [
          {
            "key": "A",
            "text": "Memihak Direktur A karena posisinya lebih kuat dan berpengaruh pada karir saya.",
            "score": 2
          },
          {
            "key": "B",
            "text": "Pura-pura mendukung keduanya di depan mereka masing-masing agar aman.",
            "score": 1
          },
          {
            "key": "C",
            "text": "Tetap bersikap profesional, netral, menolak masuk ke konflik pribadi, dan fokus pada tugas.",
            "score": 5
          },
          {
            "key": "D",
            "text": "Mengajukan permohonan pindah divisi karena suasana kerja sudah tidak sehat.",
            "score": 3
          },
          {
            "key": "E",
            "text": "Mencoba mendamaikan mereka dengan mengajak bicara baik-baik saat suasana tenang.",
            "score": 4
          }
        ]
      },
      {
        "id": "P4-TKP-98",
        "category": "TKP",
        "text": "Terjadi demonstrasi besar di depan kantor Anda yang menuntut pimpinan mundur. Massa mulai anarkis dan mencoba merobos masuk lobi pelayanan di mana Anda sedang bertugas. Pimpinan sedang tidak ada di tempat. Tindakan Anda...",
        "explanation": "Aspek: Manajemen Krisis. Poin 5 (Opsi D) Keselamatan Publik + Koordinasi + Negosiasi. Poin 4 (Opsi C) Penyelamatan Diri & Aset (Mengunci pintu, logis tapi defensif).",
        "options": [
          {
            "key": "A",
            "text": "Menghadang massa sendirian di depan pintu untuk menunjukkan keberanian sebagai aparat.",
            "score": 1
          },
          {
            "key": "B",
            "text": "Segera lari menyelamatkan diri lewat pintu belakang karena takut terluka.",
            "score": 2
          },
          {
            "key": "C",
            "text": "Segera mengunci pintu lobi, mengamankan dokumen penting, dan berlindung di tempat aman.",
            "score": 4
          },
          {
            "key": "D",
            "text": "Mengevakuasi warga ke tempat aman, koordinasi dengan keamanan, dan mencoba negosiasi persuasif.",
            "score": 5
          },
          {
            "key": "E",
            "text": "Merekam kejadian tersebut untuk dijadikan barang bukti jika ada kerusakan aset.",
            "score": 3
          }
        ]
      },
      {
        "id": "P4-TKP-99",
        "category": "TKP",
        "text": "Anda menemukan bukti valid bahwa mentor yang sangat Anda hormati dan berjasa besar dalam karir Anda ternyata terlibat dalam pendanaan kelompok radikal terlarang. Sikap Anda...",
        "explanation": "Aspek: Anti-Radikalisme. Poin 5 (Opsi E) Loyalitas pada Negara (Absolut). Poin 4 (Opsi D) Menghindar (Aman, tapi pembiaran). Poin 3 (Opsi B) Persuasif (Berisiko dan naif untuk kasus terorisme).",
        "options": [
          {
            "key": "A",
            "text": "Pura-pura tidak tahu karena saya merasa berhutang budi padanya.",
            "score": 1
          },
          {
            "key": "B",
            "text": "Menemuinya secara pribadi dan memohon agar dia kembali ke jalan yang benar.",
            "score": 3
          },
          {
            "key": "C",
            "text": "Memusnahkan bukti tersebut diam-diam untuk melindungi nama baiknya.",
            "score": 2
          },
          {
            "key": "D",
            "text": "Mulai menjauhinya secara perlahan dan membatasi komunikasi tanpa melaporkannya.",
            "score": 4
          },
          {
            "key": "E",
            "text": "Melaporkan temuan tersebut kepada pihak berwenang secara rahasia demi keamanan negara.",
            "score": 5
          }
        ]
      },
      {
        "id": "P4-TKP-100",
        "category": "TKP",
        "text": "Anda menjadi saksi mata tindakan pelecehan seksual yang dilakukan oleh seorang pejabat tinggi instansi kepada staf magang. Staf tersebut takut melapor. Anda tahu risikonya karir Anda bisa tamat jika bersuara. Sikap Anda...",
        "explanation": "Aspek: Keberanian Moral. Poin 5 (Opsi D) *Activist* (Dukung + Saksi). Poin 4 (Opsi E) *Whistleblower* Anonim (Berani tapi main aman).",
        "options": [
          {
            "key": "A",
            "text": "Menyarankan korban untuk bersabar dan melupakan kejadian tersebut demi kebaikannya.",
            "score": 2
          },
          {
            "key": "B",
            "text": "Diam saja dan pura-pura tidak melihat agar karir saya tetap aman.",
            "score": 1
          },
          {
            "key": "C",
            "text": "Menceritakan kejadian ini kepada rekan kerja lain agar semua orang tahu keburukan pejabat itu.",
            "score": 3
          },
          {
            "key": "D",
            "text": "Memberikan dukungan moral, meyakinkan korban melapor, dan bersedia menjadi saksi.",
            "score": 5
          },
          {
            "key": "E",
            "text": "Mengirimkan surat laporan kaleng (anonim) kepada pimpinan tertinggi atau pengawas internal.",
            "score": 4
          }
        ]
      },
      {
        "id": "P4-TKP-101",
        "category": "TKP",
        "text": "Anda ditunjuk memimpin tim 'buangan' yang berisi pegawai bermasalah dan saling bermusuhan. Deadline proyek tinggal 3 hari lagi dan progres masih 20%. Tidak ada waktu untuk team bonding. Strategi darurat Anda...",
        "explanation": "Aspek: Kepemimpinan Situasional. Poin 5 (Opsi B) Gaya Otoriter/Direktif (Diperlukan saat krisis/deadline sempit). Poin 4 (Opsi D) *Self-Sacrifice* (Menyelamatkan proyek tapi gagal memimpin).",
        "options": [
          {
            "key": "A",
            "text": "Mengajak mereka curhat satu per satu untuk menyelesaikan masalah pribadi mereka terlebih dahulu.",
            "score": 3
          },
          {
            "key": "B",
            "text": "Mengambil kendali penuh, memberi instruksi tugas yang sangat spesifik/tegas, dan fokus pada target.",
            "score": 5
          },
          {
            "key": "C",
            "text": "Mengancam akan memberi nilai kinerja buruk jika proyek ini gagal diselesaikan.",
            "score": 4
          },
          {
            "key": "D",
            "text": "Mengerjakan bagian-bagian tersulit sendirian dan membiarkan mereka mengerjakan sisanya.",
            "score": 2
          },
          {
            "key": "E",
            "text": "Menyerah dan meminta perpanjangan waktu kepada atasan karena kondisi tim tidak kondusif.",
            "score": 1
          }
        ]
      },
      {
        "id": "P4-TKP-102",
        "category": "TKP",
        "text": "Server database kantor terkena serangan Ransomware. Hacker meminta tebusan miliaran rupiah atau data akan dihapus. Anda adalah penanggung jawab IT. Pimpinan panik dan menyuruh Anda membayar tebusan menggunakan uang kas taktis. Sikap Anda...",
        "explanation": "Aspek: TIK & Integritas. Poin 5 (Opsi D) Protokol Keamanan (Jangan bayar + Mitigasi). Poin 4 (Opsi A) Konsultasi Ahli (Benar, tapi jika disuruh bayar, opsi 5 lebih tegas menolak). *Koreksi:* Poin 4 di sini adalah konsultasi otoritas (polisi/BSSN) sebelum bertindak.",
        "options": [
          {
            "key": "A",
            "text": "Segera berkonsultasi dengan BSSN atau kepolisian siber sebelum mengambil keputusan apapun.",
            "score": 4
          },
          {
            "key": "B",
            "text": "Mencoba menawar harga tebusan kepada hacker agar lebih murah.",
            "score": 2
          },
          {
            "key": "C",
            "text": "Melaksanakan perintah pimpinan untuk membayar tebusan demi menyelamatkan data penting.",
            "score": 1
          },
          {
            "key": "D",
            "text": "Menolak membayar, mengisolasi jaringan, lapor pihak berwenang, dan memulihkan data dari backup.",
            "score": 5
          },
          {
            "key": "E",
            "text": "Mencari jasa hacker lain untuk menyerang balik hacker tersebut.",
            "score": 3
          }
        ]
      },
      {
        "id": "P4-TKP-103",
        "category": "TKP",
        "text": "Terjadi restrukturisasi organisasi besar-besaran. Jabatan Anda hilang dan Anda didemosi menjadi staf biasa dengan gaji lebih kecil, namun beban kerja tetap berat. Banyak rekan Anda yang demo dan mogok kerja. Sikap Anda...",
        "explanation": "Aspek: Resiliensi (Ketahanan Mental). Poin 5 (Opsi E) Menerima & Bangkit. Poin 4 (Opsi C) Keluar (Logis, tapi dalam konteks uji loyalitas ASN, bertahan dan berkinerja dinilai lebih tinggi).",
        "options": [
          {
            "key": "A",
            "text": "Ikut melakukan aksi mogok kerja sebagai bentuk solidaritas sesama korban restrukturisasi.",
            "score": 2
          },
          {
            "key": "B",
            "text": "Bekerja ala kadarnya sesuai dengan besaran gaji yang baru.",
            "score": 3
          },
          {
            "key": "C",
            "text": "Segera mencari pekerjaan lain yang lebih menghargai kemampuan saya.",
            "score": 4
          },
          {
            "key": "D",
            "text": "Menggugat keputusan manajemen ke pengadilan hubungan industrial.",
            "score": 1
          },
          {
            "key": "E",
            "text": "Menerima keputusan dengan lapang dada dan tetap bekerja prima untuk membuktikan kualitas diri.",
            "score": 5
          }
        ]
      },
      {
        "id": "P4-TKP-104",
        "category": "TKP",
        "text": "Anda bertugas di daerah pedalaman. Ada hukum adat setempat yang mewajibkan pemberian 'upeti' kepada kepala suku setiap kali ada proyek pemerintah. Jika tidak dituruti, keamanan proyek terancam. Di sisi lain, ini adalah pungli menurut hukum negara. Dilema Anda...",
        "explanation": "Aspek: Sosial Budaya. Poin 5 (Opsi D) Diplomasi Budaya (Mengubah pungli jadi legal/kerjasama). Poin 4 (Opsi C) Hukum Kaku (Benar secara hukum, tapi berisiko konflik sosial tinggi di lapangan).",
        "options": [
          {
            "key": "A",
            "text": "Memberikan upeti tersebut menggunakan uang pribadi demi kelancaran proyek.",
            "score": 3
          },
          {
            "key": "B",
            "text": "Mengambil sedikit dana proyek untuk membayar upeti tersebut.",
            "score": 1
          },
          {
            "key": "C",
            "text": "Menolak tegas segala bentuk pungutan dan meminta perlindungan aparat keamanan.",
            "score": 4
          },
          {
            "key": "D",
            "text": "Bermusyawarah dengan kepala suku untuk mengganti 'upeti' menjadi program pelibatan warga (padat karya).",
            "score": 5
          },
          {
            "key": "E",
            "text": "Menghentikan proyek sementara dan melapor ke pusat bahwa daerah tidak kondusif.",
            "score": 2
          }
        ]
      },
      {
        "id": "P4-TKP-105",
        "category": "TKP",
        "text": "Kesalahan fatal terjadi dalam input data penerima bantuan sosial yang menyebabkan kerugian negara. Anda tahu pelakunya adalah atasan Anda sendiri yang sedang kelelahan dan tidak sengaja (human error), bukan korupsi. Audit akan segera datang. Sikap Anda...",
        "explanation": "Aspek: Integritas & Akuntabilitas. Poin 5 (Opsi D) Perbaikan internal jujur. Poin 4 (Opsi B) Lapor Auditor (Benar, tapi terkesan 'menjebak' atasan yang *human error*, opsi D lebih konstruktif memperbaiki kesalahan sebelum jadi temuan).",
        "options": [
          {
            "key": "A",
            "text": "Membantu atasan memanipulasi data agar kesalahan tersebut tidak terdeteksi auditor.",
            "score": 1
          },
          {
            "key": "B",
            "text": "Melaporkan kesalahan atasan tersebut kepada auditor secara diam-diam.",
            "score": 4
          },
          {
            "key": "C",
            "text": "Diam saja dan pura-pura tidak tahu menahu tentang kesalahan data tersebut.",
            "score": 2
          },
          {
            "key": "D",
            "text": "Mengingatkan atasan, membantunya melakukan koreksi resmi, dan siap mempertanggungjawabkannya.",
            "score": 5
          },
          {
            "key": "E",
            "text": "Mengajukan pengunduran diri agar tidak terseret masalah hukum dikemudian hari.",
            "score": 3
          }
        ]
      },
      {
        "id": "P4-TKP-106",
        "category": "TKP",
        "text": "Seorang VVIP (Pejabat Tinggi) memaki-maki bawahan Anda di depan umum karena masalah sepele. Bawahan Anda menangis ketakutan. Si VVIP mengancam akan memecat kalian semua. Respon Anda sebagai atasan...",
        "explanation": "Aspek: Kepemimpinan (Protecting). Poin 5 (Opsi D) Pasang badan + Profesional. Poin 4 (Opsi C) Menyelamatkan bawahan (Menjauhkan), tapi Anda tidak mengambil alih tanggung jawab sepenuhnya di depan VVIP.",
        "options": [
          {
            "key": "A",
            "text": "Ikut memarahi bawahan agar VVIP merasa didukung dan emosinya mereda.",
            "score": 1
          },
          {
            "key": "B",
            "text": "Membela bawahan dengan cara membalas argumen VVIP tersebut secara keras.",
            "score": 2
          },
          {
            "key": "C",
            "text": "Meminta bawahan segera pergi dari lokasi, lalu saya diam mendengarkan amarah VVIP.",
            "score": 4
          },
          {
            "key": "D",
            "text": "Mengambil alih tanggung jawab, meminta maaf secara profesional, dan meminta bawahan menyingkir.",
            "score": 5
          },
          {
            "key": "E",
            "text": "Merekam kejadian tersebut diam-diam untuk barang bukti jika diperkarakan.",
            "score": 3
          }
        ]
      },
      {
        "id": "P4-TKP-107",
        "category": "TKP",
        "text": "Tim Anda gagal mencapai target tahunan. Dalam rapat evaluasi, anggota tim ramai-ramai menjadikan Anda 'kambing hitam' dan menyalahkan kepemimpinan Anda, padahal Anda sudah berusaha maksimal memfasilitasi mereka. Reaksi Anda...",
        "explanation": "Aspek: Kematangan Emosi. Poin 5 (Opsi E) *Ownership* (Ambil tanggung jawab) + Evaluasi Data. Poin 4 (Opsi A) Defensif dengan data (Benar, tapi sikap pemimpin sebaiknya *absorb pressure* dulu baru evaluasi).",
        "options": [
          {
            "key": "A",
            "text": "Membela diri dengan membeberkan bukti data kelalaian anggota tim satu per satu.",
            "score": 4
          },
          {
            "key": "B",
            "text": "Marah dan meninggalkan ruang rapat karena merasa dikhianati oleh tim sendiri.",
            "score": 1
          },
          {
            "key": "C",
            "text": "Menerima semua kesalahan tersebut dan langsung mengundurkan diri dari jabatan ketua.",
            "score": 2
          },
          {
            "key": "D",
            "text": "Melaporkan ketidakloyalan anggota tim kepada pimpinan yang lebih tinggi.",
            "score": 3
          },
          {
            "key": "E",
            "text": "Tetap tenang, mengakui tanggung jawab sebagai pemimpin, lalu mengajak evaluasi objektif berbasis data.",
            "score": 5
          }
        ]
      },
      {
        "id": "P4-TKP-108",
        "category": "TKP",
        "text": "Hari ini adalah pelantikan jabatan baru Anda yang sudah ditunggu selama 5 tahun. Satu jam sebelum acara, Anda mendapat kabar orang tua Anda serangan jantung dan masuk ICU. Jarak rumah sakit 3 jam perjalanan. Keputusan Anda...",
        "explanation": "Aspek: Profesionalisme vs Pribadi. Poin 5 (Opsi D) Kompromi Cerdas (Delegasi keluarga -> Tugas Negara -> Keluarga). Poin 4 (Opsi E) Video Call (Teknologi membantu kehadiran virtual, tapi kehadiran fisik pasca tugas tetap penting).",
        "options": [
          {
            "key": "A",
            "text": "Membatalkan pelantikan saat itu juga dan langsung pergi ke rumah sakit.",
            "score": 3
          },
          {
            "key": "B",
            "text": "Tetap mengikuti pelantikan namun dengan pikiran yang kacau dan tidak fokus.",
            "score": 2
          },
          {
            "key": "C",
            "text": "Meminta panitia untuk menunda pelantikan khusus untuk saya di hari lain.",
            "score": 1
          },
          {
            "key": "D",
            "text": "Meminta kerabat mendampingi di ICU, mengikuti pelantikan secepatnya, lalu segera menyusul ke RS.",
            "score": 5
          },
          {
            "key": "E",
            "text": "Melakukan panggilan video dengan orang tua/keluarga di RS untuk memastikan kondisi sebelum acara.",
            "score": 4
          }
        ]
      },
      {
        "id": "P4-TKP-109",
        "category": "TKP",
        "text": "Anda menemukan metode pelayanan yang bisa memangkas birokrasi dari 5 meja menjadi 1 meja (One Stop Service). Namun, aturan lama mewajibkan 5 meja. Mengubah aturan butuh waktu tahunan. Apa yang Anda lakukan?",
        "explanation": "Aspek: Inovasi. Poin 5 (Opsi E) *Back-end Integration* (Inovasi tanpa melanggar aturan). Poin 4 (Opsi D) Prosedural (Mengajukan revisi, aman tapi lambat).",
        "options": [
          {
            "key": "A",
            "text": "Tetap menggunakan sistem 5 meja sesuai aturan yang berlaku agar tidak menyalahi prosedur.",
            "score": 2
          },
          {
            "key": "B",
            "text": "Langsung memotong prosedur menjadi 1 meja tanpa izin demi kepuasan masyarakat.",
            "score": 3
          },
          {
            "key": "C",
            "text": "Menunggu sampai ada instruksi perubahan aturan dari pusat baru berani bertindak.",
            "score": 1
          },
          {
            "key": "D",
            "text": "Mengajukan naskah akademis revisi aturan ke pusat dan menunggu persetujuan.",
            "score": 4
          },
          {
            "key": "E",
            "text": "Membuat sistem internal satu pintu (berkas diproses staf di belakang layar) sambil mengajukan legalitas.",
            "score": 5
          }
        ]
      },
      {
        "id": "P4-TKP-110",
        "category": "TKP",
        "text": "Instansi Anda viral karena kasus korupsi besar. Publik menghujat dan memberi cap negatif pada semua pegawai, termasuk Anda yang jujur. Mental tim hancur. Sebagai agen perubahan, apa pesan Anda kepada tim?",
        "explanation": "Aspek: Ketahanan Mental & Motivasi. Poin 5 (Opsi E) *Proof by Action* (Buktikan dengan kinerja). Poin 4 (Opsi D) *Stoic* (Diam & Biarkan, baik untuk mental tapi kurang proaktif memulihkan citra).",
        "options": [
          {
            "key": "A",
            "text": "'Kita harus aktif membalas komentar netizen untuk membela diri kita!'",
            "score": 2
          },
          {
            "key": "B",
            "text": "'Sudahlah, kita bekerja seperti biasa saja, tidak usah pedulikan omongan orang.'",
            "score": 3
          },
          {
            "key": "C",
            "text": "'Sebaiknya kita mencari peluang pindah ke instansi lain yang citranya masih bagus.'",
            "score": 1
          },
          {
            "key": "D",
            "text": "'Biarlah waktu yang menjawab, kita diam saja dan jangan terpancing emosi.'",
            "score": 4
          },
          {
            "key": "E",
            "text": "'Jadikan ini cambuk pembuktian. Tunjukkan lewat pelayanan prima bahwa kita bersih dan profesional.'",
            "score": 5
          }
        ]
      }
    ]





